{"pageContext":{"isCreatedByStatefulCreatePages":false,"url":"/projects/horizon-iii-ocean-oasis/","relativePath":"projects/horizon-iii-ocean-oasis.md","relativeDir":"projects","base":"horizon-iii-ocean-oasis.md","name":"horizon-iii-ocean-oasis","frontmatter":{"title":"Horizon III Ocean Oasis","subtitle":"Maldives - Open boat - Groups min 10 pax","date":"2020-03-21T14:18:54.748Z","thumb_img_path":"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-.jpg","content_img_path":"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-.jpg","template":"project"},"html":"<h3>The Horizon III Ocean Oasis charter boat is here to make your dream charter holiday a reality and cruises at a speed of up to 14 knots.</h3>\n<p>They have over 20’ years of experience in Maldives surf &#x26; dive trips. The captain will take you to the best spots for surfing or diving.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-lounge.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Lounge\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Lounge\"></p>\n<p>The Horizon III Ocean Oasis is a high-quality boat with a focus on comfort and safety. With 12 cabins it can accommodate up to 24 surfers or divers but they can start a private trip with 10 people and prefer to take only 14 guests maximum. <br>\n<br>\nThe boat was built in 2009 and has been renovated in 2015. They have the same award-winning crew for many years. They are committed to providing excellent services to all guests.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-cabins.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Cabins\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Cabins\"></p>\n<p>The Ocean Oasis charter offers you very spacious living areas. It has comfortable leisure decks and an outside jacuzzi. The interior is open and light, giving you a ‘home away from home’ feeling. There is a spa onboard with an experienced Ayurvedic therapist.</p>\n<p>The boat has 3 deluxe and 9 standard cabins with double or single beds ranging from 8 to 20 m2 in size. All cabins have an ensuite bathroom and airconditioning. And you can choose one of the 5 areas onboard to relax. Internet, rental equipment and dive courses are available for an extra fee.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-jacuzzi.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Jacuzzi\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Jacuzzi\"></p>\n<p>Surf and dive trips onboard Horizon III Ocean Oasis are all included. 3 meals per day are provided in buffet style with western and local food. Free tea and coffee and 1,5-litre water per person are provided. We care about coral reef and marine life and try to reduce cans and plastic water bottles.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-meals.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives buffet\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives buffet\"></p>\n<p>The 20-meter tender dhoni is included and can host all the surf or dive equipment. There is a surf or dive guide on board. Local fishing line &#x26; baits are provided. Above that, the SUP is available for your use. Some extra activities, like island hopping, a bbq on a local island, night fishing or city excursion are included, weather permitted.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-dining.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Dining\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Dining\"></p>\n<h4>The Horizon III Ocean Oasis is an excellent choice if you want high comfort, extra luxury features and top service!</h4>","pages":[{"url":"/about/","relativePath":"about.md","relativeDir":"","base":"about.md","name":"about","frontmatter":{"title":"About Us","subtitle":"We search the most suitable and best surf charter options for you.","img_path":"","menus":{"main":{"title":"About","weight":4}},"template":"page"},"html":"<p>LTL Surfcharters has over 10 years experience in assisting surfers with their surf boat bookings in Maldives, Mentawais, Banyaks and beyond.</p>\n<p>Let us do the searching for you. All you have to do is fill out the form with your requirements on our <a href=\"https://ltlsurfcharters-680b6.netlify.com/contact/\">contact page</a>. We will email you within 24 hours and find you the best suitable charter trip options. Is there a specific boat that interests you ? We’ll check with that boat and many more if you like …</p>\n<p>Our assistance is free and the booking process is easy. When you make your choice, you pay to the responsible owner or local agent directly, with no extra booking fees. We make sure they offer you their best rate!</p>\n<p>We are looking forward to assist you with securing your charter trip.</p>\n<h4>We plant 10 trees per surfer &#x26; 100 per full charter booking.</h4>\n<p><img src=\"/images/onetreeplanted-logo.png\" alt=\"Partnership LTL Surfcharters with OneTreePlanted\" title=\"Partnership LTL Surfcharters with OneTreePlanted\"></p>"},{"url":"/contact/","relativePath":"contact.md","relativeDir":"","base":"contact.md","name":"contact","frontmatter":{"title":"Contact","menus":{"main":{"title":"Contact","weight":5}},"template":"contact"},"html":"<p>Contact us through the form below. We'll get back to you within 24 hours and often much sooner.<br>\n<br>\nTo offset your carbon footprint, we plant trees if you book and send you the certificate.</p>\n<p><img src=\"/images/onetreeplanted-logo.png\" alt=\"LTL Surfcharters plants trees for every booking with OneTreePlanted.org\" title=\"LTL Surfcharters plants trees for every booking with OneTreePlanted.org\"></p>\n<p>We are looking forward to assist you in finding the best suitable surf charter trip. Please fill the below contact form or send us an email at contact@ltlsurfcharters.com:</p>"},{"url":"/","relativePath":"index.md","relativeDir":"","base":"index.md","name":"index","frontmatter":{"title":"Home","sections":[{"component":"HeroBlock","content":"A surf charter trip is the ultimate surfers dream. Perfect waves with nothing but a few friends and crystal clear water. Surfing all day, then relaxing at sunset aboard a gently rocking vessel with a beer. Waking up early the next morning for the next surf session. Surf, relax and repeat.","section_id":"hero","title":"Welcome to LTL Surf Charters","type":"heroblock"},{"component":"PortfolioBlock","layout_style":"mosaic","num_projects_displayed":6,"section_id":"latest-surfcharters","subtitle":"LTL Surf Charters offers a wide collection of the best surf boats. ","title":"Surfcharters Collection","type":"portfolioblock","view_all_text":"View All","view_all_url":"portfolio/index.html"},{"component":"ServicesBlock","section_id":"services","serviceslist":[{"content":"There are so many surf boats out there. Let us guide you to find the best suitable surf charter vessel for you. Join a trip as a single surfer, with a small group or book a private surf boat with your friends.","title":"Free Personal Assistance"},{"content":"We work directly with the boat owners. We make sure you get the best deal; we will offer you all early booking or last-minute rates and give you the extra commission we receive as a discount.","title":"Best Rates & Specials"},{"content":"The most popular regions for surf charter trips are certainly Maldives and Mentawai Islands. We also selected surfboat that specialise in Banyaks and Telos Islands. Each region is different in many ways.","title":"All Surf Regions"},{"content":"LTL Surf Charters plants trees to offset your carbon footprint. We plant 10 trees per single surfer booking and 100 if you book a private charter. We send you the tree certificate after your trip.","title":"Trees Planted for each booking"}],"subtitle":"","title":"What We Offer","type":"servicesblock"},{"component":"TestimonialsBlock","section_id":"testimonials","subtitle":"We go the extra mile...","testimonialslist":[{"author":"Eduardo, Spain","avatar":"","content":"“Everything has been great. The crew was better than I expected, and the surf charter was very comfortable. I’m very grateful for you and your service. It was an excellent treat !! I hope to come again and i will let you guide me ! Thanks a lot ! All the best !”"},{"author":"Kahi, Hawaï","avatar":"","content":"“As a past client of LTL Surfcharters my choice to use their services in the future is a resounding hell yeah! We wanted to travel half way around the world to the Maldives. I checked with them through a recommendation. They have a regularly updated list of last minute deals. The process was easy to book and when we landed in the Maldives we had staff waiting and ready to lug our bags to the boat.”"}],"title":"Testimonials","type":"testimonialsblock"},{"component":"ContactBlock","section_id":"contact","subtitle":"Send us your preferred region, for how many surfers, your dates and phone number with country code, so we can call you if we need extra information to find you the best surf charter options. We'll get back to you within 24 hours and often much sooner.","title":"Contact Us","type":"contactblock"},{"actions":[{"label":"View Editorial","url":"blog/index.html"}],"component":"PostsBlock","num_posts_displayed":2,"section_id":"latest-posts","subtitle":"","title":"Editorial","type":"postsblock"}],"menus":{"main":{"title":"Home","weight":1}},"template":"home"},"html":""},{"url":"/privacy-policy/","relativePath":"privacy-policy.md","relativeDir":"","base":"privacy-policy.md","name":"privacy-policy","frontmatter":{"title":"Privacy Policy","menus":{"main":{"title":"Privacy Policy","weight":5}},"template":"page"},"html":"<h3><strong>Privacy Policy of LTL Surf Charters</strong></h3>\n<p>LTL – LIVE THE LIFE CC operates the <a href=\"https://ltlsurfcharters.com\">https://ltlsurfcharters.com</a> website, which provides Personalised Charter Booking Assistance to its website visitors.</p>\n<p>This page is used to inform website visitors regarding our policies for the collection, use, and disclosure of Personal Information.</p>\n<p>If you choose to use our Services, then you agree to the collection and use of information in relation with this policy. The Personal Information that we collect are used for providing and improving our Charter Booking Assistance. We will not use or share your information with anyone except as described in this Privacy Policy.</p>\n<h3>Information Collection and Use</h3>\n<p>For a better experience while using our Service, we may require you to provide us with certain personally identifiable information. This includes but is not limited to your name, email, country and phone number. The information that we collect will be used to contact or identify you. Your personal details will be sent to our partner once you decide to book a charter.</p>\n<h3>Log Data</h3>\n<p>We want to inform you that whenever you visit our website, we collect information, just like any website does. This information is sent by your browser and called Log Data. This Log Data may include information such as your computer’s Internet Protocol (“IP”) address, browser version and pages of our website that you visit. Other log data is the time and date of your visit, the time spent on our pages, and other statistics.</p>\n<h3>Cookies</h3>\n<p>Cookies are files with small amount of data that is commonly used as an anonymous unique identifier. These are sent to your browser from the website that you visit and are stored on your computer’s hard drive. Our website uses these “cookies” to collect information and to improve our Services.</p>\n<h3>Service Providers</h3>\n<p>We may employ third-party companies and individuals due to the following reasons:<br>\n– To facilitate our Services;<br>\n– To provide the Service on our behalf;<br>\n– To perform Service-related services; or<br>\n– To assist us in analysing how our website is used.</p>\n<p>We want to inform our website users that these third parties might have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose.</p>\n<h3>Security</h3>\n<p>We value your trust in providing us your personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable. Therefore we cannot guarantee its absolute security.</p>\n<h3>Links to Other Sites</h3>\n<p>Our Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.</p>\n<h3>Children’s Privacy</h3>\n<p>Our Services do not address anyone under the age of 16. We do not knowingly collect personally identifiable information from children under 16. In the case we discover that a child under 16 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us.</p>\n<h3>Business Transaction</h3>\n<p>As we develop our website, we may sell our business. Customer details and visitor information is generally one of the transferred business assets in these types of transactions. We may also transfer such information in the course of corporate divestitures, mergers or dissolution.</p>\n<h3>Disclaimer</h3>\n<p>This disclaimer is for your protection. Please read it carefully as this notifies you in writing of LTL Surf Charters’ limited liability and the responsibilities you accept by receiving benefits of service through the LTL Surf Charters website. By using these services you agree to the terms and conditions of this disclaimer.</p>\n<p>The LTL Surf Charter website is primarily a service for personal assistance in finding its customers the best charter options.</p>\n<p>LTL Surf Charters is not a licensed travel agent or broker in any state or country.</p>\n<p>LTL Surf Charters and its owners, employees or contract workers assumes no responsibility and in no way warrant the quality, safety, legality, truth or accuracy of the information contained in any of the pages provided throughout this website. You assume all liability for use of any information you find in any page on this site or that is supplied to you by email.</p>\n<p>LTL Surf Charters expects its Partners and Advertisers to provide truthful and accurate information, but cannot ensure this, or control the behaviour of Owners/Agents and Advertisers. Owners/Agents and Advertisers are deemed to be responsible for confirming information before enlisting services and to qualify all Clients before entering into a contract. LTL Surf Charters cannot ensure that Owners/Agents, Advertisers or Clients will complete any transaction nor is it liable for any claim between Clients, Owners/Agents and Advertisers.</p>\n<p>By use of this site, Owners/Agents, Advertisers and Clients agree to accept these risks. LTL Surf Charters is not responsible for any action, or omission of action, by any Client obtained by the use of this site. LTL Surf Charters accepts no liability whatsoever for any loss, whether direct, indirect or consequential, arising from information made available on these pages and through email and actions or transactions resulting therefrom.</p>\n<p>All calculations done through the use of software or calculators supplied on these pages and by email, including the rates quoted, are guidelines only and subject to final confirmation by the owner/agent of the charter at the time of finalising the transaction. All information regarding products and services, including information in respect of the terms and conditions, interest rates or any other matters are subject to change without notice.</p>\n<h3>Changes to This Privacy Policy</h3>\n<p>We may update our Privacy Policy from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately after they are posted on this page.</p>\n<h3>Contact Us</h3>\n<p>If you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us through email on contact@ltlsurfcharters.com</p>"},{"url":"/portfolio/","relativePath":"portfolio/index.md","relativeDir":"portfolio","base":"index.md","name":"index","frontmatter":{"title":"Surf Charter Collection","subtitle":"Here you find a selection of the surf boats managed by our partners. We have access to many more and can put you in direct contact with any surf charter owner.  ","layout_style":"mosaic","menus":{"main":{"title":"Collection","weight":2}},"template":"portfolio"},"html":""},{"url":"/blog/","relativePath":"blog/index.md","relativeDir":"blog","base":"index.md","name":"index","frontmatter":{"title":"Editorial","menus":{"main":{"title":"Editorial","weight":3}},"template":"blog"},"html":""},{"url":"/projects/blue-horizon-2/","relativePath":"projects/blue-horizon-2.md","relativeDir":"projects","base":"blue-horizon-2.md","name":"blue-horizon-2","frontmatter":{"title":"Blue Horizon 2","subtitle":"Maldives - Fixed Schedule - Individual/Group","date":"2020-03-12T15:46:02.817Z","thumb_img_path":"/images/blue-horizon-ii-surf-charter-maldives-boat.jpg","content_img_path":"/images/blue-horizon-ii-surf-charter-maldives-boat.jpg","template":"project"},"html":"<p>The Blue Horizon Surf Charter Boat Trips will take you out surfing in the Maldives Atolls. They have a fleet of different surf boats that sail out following a fixed schedule. They organize diving trips too. The Horizon II surf charter is a medium class boat with an experienced crew that will pick you up at the airport and transport you to the boat.</p>\n<p><img src=\"/images/blue-horizon-ii-surf-charter-maldives-deck.jpg\" alt=\"Blue Horizon 2 Surf Charter Boat Maldives Decks\" title=\"Blue Horizon 2 Surf Charter Boat Maldives Decks\"></p>\n<p>There are 6 air-conditioned rooms on the boat or a capacity of 12 guests. Each cabin has a bathroom with shower and hot and cold water. There are 2 double bedrooms and 4 twin bedrooms on board. All meals, snacks and coffee and tea are included. There is a 1,5 liter mineral water bottle per person per day.</p>\n<p><img src=\"/images/blue-horizon-ii-surf-charter-maldives-bunks-.jpg\" alt=\"Blue Horizon 2 Surf Charter Boat Maldives Cabins\" title=\"Blue Horizon 2 Surf Charter Boat Maldives  Cabins\"></p>\n<p>Besides surfing, you can enjoy local-style fishing with line and baits and snorkelling. You can enjoy island hopping and cruising, depending on the weather. The crew will make sure you can surf as much as you want and take pictures of your trip and surfing. The 18-meter Whahira Dhoni will take you to the waves.</p>\n<p><img src=\"/images/blue-horizon-ii-surf-charter-maldives-sundeck.jpg\" alt=\"Blue Horizon 2 Surf Charter Boat Maldives Lounging\" title=\"Blue Horizon 2 Surf Charter Boat Maldives  Lounging\"></p>\n<p>The surf charter boat has all necessary safety equipment and can get up to 12 knots of sail speed. You can relax on the sundeck with lounge chairs and enjoy dining at the open air table or inside. The inside lounge area with DVD player and LCD TV is perfect for watching surf movies or playing board games with your surf friends.</p>\n<p><img src=\"/images/blue-horizon-ii-surf-charter-maldives-dining.jpg\" alt=\"Blue Horizon 2 Surf Charter Boat Maldives  Dining\" title=\"Blue Horizon 2 Surf Charter Boat Maldives  Dining\"></p>\n<h3>INCLUDED:</h3>\n<ul>\n<li>Full Board 3 meals (Breakfast, Lunch, Dinner) </li>\n<li>free tea &#x26; coffee and water throughout the day.</li>\n<li>Surfing from 0630 hrs to 1700 hrs (surf safaris from March to October)</li>\n<li>Local Fishing with line &#x26; baits.</li>\n<li>Uninhabited island barbecue dinner</li>\n<li>Island hopping, resort visits and cruising (subject to the group’s majority decision)</li>\n<li>Services of professional surf guidance on board.</li>\n<li>Transfers from Domestic Airport to Boat (return) </li>\n<li>Last day surf stops at 12:00 hrs (noon)</li>\n</ul>\n<h3>NOT INCLUDED:</h3>\n<ul>\n<li>USD 100.00 service charge for the crew min per week per guest </li>\n<li>Picnic on an island per person at US$10.00</li>\n</ul>\n<h4>REMINDERS:</h4>\n<ul>\n<li>Check In @ 12:00 hrs and Check Out @ 07:00 hrs (Male’ and Vaavu Atoll).</li>\n<li>Check In @ 20:00 hrs and Check Out @ 16:30 hrs (South Maldives – Huvadhoo Surf)</li>\n</ul>\n<h4>CANCELLATIONS:</h4>\n<ul>\n<li>The confirmation 30% of the invoice amount cannot be refunded</li>\n<li>90 days prior safari start date 70% of the total amount</li>\n<li>60 days prior safari start 100% of the total amount</li>\n</ul>\n<p><img src=\"/images/blue-horizon-surf-charter-boat-trips-maldives.jpg\" alt=\"Blue Horizon 2 Surf Charter Boat Maldives Cruising\" title=\"Blue Horizon 2 Surf Charter Boat Maldives Cruising\"></p>"},{"url":"/projects/blue-horizon-catamaran/","relativePath":"projects/blue-horizon-catamaran.md","relativeDir":"projects","base":"blue-horizon-catamaran.md","name":"blue-horizon-catamaran","frontmatter":{"title":"Blue Horizon Catamaran","subtitle":"Maldives - Custom dates - Private charter bookings","date":"2020-03-10T13:20:59.094Z","thumb_img_path":"/images/surf-catamaran-maldives-blue-horizon-cruising.jpg","content_img_path":"/images/surf-catamaran-maldives-blue-horizon-cruising.jpg","template":"project"},"html":"<h3>The Blue Horizon Catamaran is perfect for smaller groups and up to 8 people maximum.</h3>\n<p>A perfect option for that special occasion with your partner, family or friends. They can take you surfing or also sailing, fishing or snorkelling. They can take you to the Maldives area of your choice, like South Male, Thaa &#x26; Laamu Atoll, Dhaalu, Faafu, Meemu, Vaavu or….. Almost anything is possible.</p>\n<p><img src=\"/images/surf-catamaran-maldives-blue-horizon-deck.jpg\" alt=\"Blue Horizon Surf Catamaran Private Charter Outside Dining Area\" title=\"Blue Horizon Surf Catamaran Private Charter Outside Dining Area\"></p>\n<h4>Surf Package rates with the Blue Horizon Catamaran are all included:</h4>\n<ul>\n<li>meet and great at the airport</li>\n<li>welcome drinks</li>\n<li>skipper and crew</li>\n<li>3 meals</li>\n<li>water, tea and coffee</li>\n<li>unlimited surfing</li>\n<li>local style fishing</li>\n</ul>\n<p><img src=\"/images/surf-catamaran-maldives-blue-horizon-dining.jpg\" alt=\"Blue Horizon Surf Catamaran Private Charter Dining\" title=\"Blue Horizon Surf Catamaran Private Charter  Dining\"></p>\n<p><br>\nYou can enjoy exquisite world cuisine, served in the indoor dining area or on the front deck, from where you can enjoy the breathtaking scenery.</p>\n<p>The Blue Horizon Catamaran offers the highest comfort in their 4 air-conditioned cabins. You will feel like staying in a five-star hotel with the ultimate freedom and breathtaking views. Plan your own itinerary and fill it up with activities. Like a bbq on a deserted island, some island hopping, visiting resorts,…..</p>\n<p><img src=\"/images/surf-catamaran-maldives-blue-horizon-cabin.jpg\" alt=\"Blue Horizon Surf Catamaran Private Charter Cabin\" title=\"Blue Horizon Surf Catamaran Private Charter  Cabin\"></p>\n<p>The Blue Horizon Catamaran has 2 bathrooms with shower. There is a deck shower, dingy and bathing ladder. For your entertainment there are board games, a CD/DVD/MP3 player with USB port and a radio. Your safety is guaranteed with all the emergency equipment on board. An extra surf dhoni can be hired for US$ 200 per day extra and for a surf guide it’s US$ 60 per day extra.</p>\n<p>They can supply a kayak or SUP on request. For travelling outside of the Male area, fuel charges are applicable.</p>\n<p>Rates depend on the number of guests and season. Ask us for a custom quote ….</p>\n<p><img src=\"/images/surf-catamaran-maldives-blue-horizon-charter.jpg\" alt=\"Blue Horizon Surf Catamaran Private Charter \" title=\"Blue Horizon Surf Catamaran Private Charter \"></p>"},{"url":"/projects/blue-star/","relativePath":"projects/blue-star.md","relativeDir":"projects","base":"blue-star.md","name":"blue-star","frontmatter":{"title":"Blue Star","subtitle":"Maldives - No schedule/Open boat - Individual/Group","date":"2020-03-18T16:35:07.076Z","thumb_img_path":"/images/blue-star-open-boat-surf-charter-maldives.jpg","content_img_path":"/images/blue-star-open-boat-surf-charter-maldives.jpg","template":"project"},"html":"<h3>Blue star operates as a floating hotel without a fixed trip schedule. You can join for the dates of your choice.</h3>\n<p>Blue Star is the new name for Anloran, a popular boat that has been cruising the Maldives since 10 years. It was renovated in 2017 and is a value-for-money surf charter. A great option for single surfers or small groups. </p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-dining.jpg\" alt=\"Blue Star Open Boat Surf Charter Maldives Dining\" title=\"Blue Star Open Boat Surf Charter Maldives Dining\"></p>\n<p>You can book the whole boat with your group of friends or make a booking as a single surfer. You decide when you arrive and go home again. They will transfer you with a speedboat from and back to the airport.</p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-cabin.jpg\" alt=\"Blue Star Open Boat Surf Charter Maldives Cabins\" title=\"Blue Star Open Boat Surf Charter Maldives Cabins\"></p>\n<p>The Blue Star Surf Charter offers 11 double cabins. The boat has 3 decks and enough surfboard storage. The spacious lounge area is air-conditioned and has TV, DVD, internet, a bar, restaurant services and more… Your comfort and safety are guaranteed.</p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-lounge.jpg\" alt=\"Blue Star Open Boat Surf Charter Maldives Lounge\" title=\"Blue Star Open Boat Surf Charter Maldives Lounge\"></p>\n<p>Andres, the owner, is your surf guide and will take you to the best waves for the day. He has 10 years of experience in surfing the Maldives. Together with the crew, they make sure you will have a great experience onboard. Andres speaks English, Italian and Spanish.</p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-lineup.jpg\" alt=\"Blue Star Open Boat Surf Charter Maldives Waves\" title=\"Blue Star Open Boat Surf Charter Maldives Waves\"></p>\n<p>In North Male Atoll you can surf waves like Sultans, Chickens, Jails, Cockes, Honkies and others and in South Male Atoll you can surf Gurus, Quarters, Last Stop and much more…. Early and late season, the boat goes to Southern Atolls. Always in search of uncrowded waves. Blue Star is accompanied by a dingy. Between surf sessions, you can use the fishing and snorkelling gear.</p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-sundeck.jpg\" alt=\"Blue Star Open Boat Surf Charter Maldives Sundeck\" title=\"Blue Star Open Boat Surf Charter Maldives Sundeck\"></p>\n<h4>INCLUDED:</h4>\n<p>– Meeting at the airport.<br>\n– Welcome drink<br>\n– Accommodation in double cabins<br>\n– Full board (3 meals per day, morning and evening snacks)<br>\n– Coffee, tea and water<br>\n– Surf Guide<br>\n– Local island shopping<br>\n– Dingy capacity for 10 passengers<br>\n– Snorkel and fishing gears<br>\n– GST tax<br>\n– Green Tax (6 US$ per day/guest)</p>\n<h4>NOT INCLUDED:</h4>\n<p>– Soft drinks (2 US$)<br>\n– Beer (4 US$)<br>\n– Liquors (please consult)<br>\n– Service charges (5 US$ per day/guest)<br>\n– Return Airport transfer by Dhoni:<br>\n•1 Surfer: 200 US$<br>\n•2 Surfers: 100 US$/person<br>\n•3 Surfers: 75 US$/person<br>\n•4 Surfers: 65 US$/person</p>\n<h4>ON REQUEST:</h4>\n<p>– Vegetarian or Allergic diets must be requested in advance. (10 US$ person/day extra)<br>\n– WIFI connection: 20US$ (no time limit)<br>\n– Video recording &#x26; editing<br>\n– Photo Sessions</p>\n<h4>REMARKS:</h4>\n<p>Late check-out (after 12.00 noon) + 50% of the cost of one day.</p>\n<p><img src=\"/images/blue-star-open-boat-surf-charter-maldives-waves.jpg\" alt=\"Blue Star Surf Charter Maldives Open Boat Waves\" title=\"Blue Star Surf Charter Maldives Open Boat Waves\"></p>"},{"url":"/projects/carpe-diem/","relativePath":"projects/carpe-diem.md","relativeDir":"projects","base":"carpe-diem.md","name":"carpe-diem","frontmatter":{"title":"Carpe Diem","subtitle":"Maldives Atolls - Fixed/Custom Dates - Individual/Group","date":"2020-03-14T13:26:46.839Z","thumb_img_path":"/images/carpe-diem-maldives-surf-boat-charter.jpg","content_img_path":"/images/carpe-diem-maldives-surf-boat-charter.jpg","template":"project"},"html":"<h3>The Carpe Diem Boat Charter is a luxury option for your surfing or diving trip.</h3>\n<p>You can cruise in style and will be pampered by the crew, while scuba diving or surfing 3 to 4 times a day. We will show you everything the Maldives has to offer. So you enjoy the sunsets, the beautiful waves, the underwater fauna and flora and the tropical islands.</p>\n<p><img src=\"/images/carpe-diem-maldives-surf-boat-charter-sundeck.jpg\" alt=\"Carpe Diem Boat Charter Maldives Surfing and Diving Sundeck\" title=\"Carpe Diem Boat Charter Maldives Surfing and Diving \"></p>\n<p>The MV Carpe Diem boat is 35 meters long and accompanied by a modern dhoni and a small speed boat. We cater for individuals and groups that want to go diving, surfing or enjoy a custom cruise. The boat takes up to 20 people in 10 air-conditioned suites with private bathroom. On surfing trips they take maximum 12 surfers.</p>\n<p><img src=\"/images/carpe-diem-boat-charter-maldives-5.jpg\" alt=\"Carpe Diem Boat Charter Maldives Surfing and Diving Deck\" title=\"Carpe Diem Boat Charter Maldives Surfing and Diving  Deck\"></p>\n<p>The Carpe Diem boat charter has recently been refurbished and is revised after every season. The lower deck provides 6 standard cabins, the engine room and crew quarters.</p>\n<p><img src=\"/images/carpe-diem-maldives-surf-boat-charter-suite.jpg\" alt=\"Carpe Diem Boat Charter Maldives Surfing and Diving Suite\" title=\"Carpe Diem Boat Charter Maldives Surfing and Diving Suite\"></p>\n<p>On the main deck, you will find the lounge area with coffee and tea corner. In addition, there is an entertainment station with flat screen tv, DVD and MP3 players. Furthermore, the main deck has 2 double cabins and an open-air social sitting area at the back of the boat.</p>\n<p><img src=\"/images/carpe-diem-maldives-surf-boat-charter-lounge.jpg\" alt=\"Carpe Diem Boat Charter Maldives Surfing and Diving Lounge\" title=\"Carpe Diem Boat Charter Maldives Surfing and Diving  Lounge\"></p>\n<p>The upper deck comprises the deluxe and suite cabins. It has a spacious C-shape sofa/reading area with a library. You will enjoy excellent buffet meals, served in the open air dining area. The main bar is located at the back of the boat, offering stunning ocean views.</p>\n<p><img src=\"/images/carpe-diem-maldives-surf-boat-charter-outside-dining.jpg\" alt=\"Carpe Diem Boat Charter Maldives Surfing and Diving Dining\" title=\"Carpe Diem Boat Charter Maldives Surfing and Diving  Dining\"></p>\n<p>Finally, you can reach the 115 m2 sun deck through the staircase from the dining area. It’s partially shaded and has comfortable lounge chairs to relax and unwind.</p>\n<p>Above all, the Carpe Diem Boat Charter really has everything to give you an unforgettable Maldives experience.</p>"},{"url":"/projects/carpe-vita-explorer/","relativePath":"projects/carpe-vita-explorer.md","relativeDir":"projects","base":"carpe-vita-explorer.md","name":"carpe-vita-explorer","frontmatter":{"title":"Carpe Vita Explorer","subtitle":"All Maldives Atolls - Fixed Schedule: 7/10 nights - Custom options","date":"2020-03-08T10:05:29.458Z","thumb_img_path":"/images/carpe-vita-explorer-maldives-surf-charter-boat.jpg","content_img_path":"/images/carpe-vita-and-dhoni-aerial-copy.jpg","template":"project"},"html":"<h2>The Carpe Vita Explorer was rated top 10 Liveaboards in the World in 2017 &#x26; 2018.</h2>\n<p>In other words, it is one of the most luxurious boats to nourish your adrenaline-filled Maldivian dreams. On the other hand, you can retreat in your en-suite cabin and relax on the sundeck with jacuzzi.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-jacuzzi.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Jacuzzi\" title=\"Carpe Vita Explorer Maldives Surf Charter Jacuzzi\"></p>\n<p>Above all, the Carpe Vita Explorer is the ideal choice for groups of up to 20 people. Catering for friends, family, couples and solo travellers. Exploring different surfing, diving and fishing itineraries. Cruising around northern, central and southern atolls in Maldives. While offering up to 4 dive or surf sessions a day.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-suite-cabin.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Cabin Suite\" title=\"Carpe Vita Explorer Maldives Surf Charter Cabin Suite\"></p>\n<h4>The Carpe Vita Explorer offers 10 comfortable cabins with different standards, divided over 3 decks.</h4>\n<p>All cabins are fully air-conditioned with a private bathroom. They have a deposit box and a TV screen connected to the server with the latest movies.</p>\n<p>Firstly, the lower deck offers 6 standard cabins, crew cabins and the engine room.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-inside-lounge-area.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Lounge\" title=\"Carpe Vita Explorer Maldives Surf Charter Lounge\"></p>\n<p>Secondly, the main deck comprises the air-conditioned lounge area with buffet and entertainment area. With a comfortable sitting area that has several plug points for laptops and a camera recharging table. Further, the main deck has 2 superior rooms. It has a platform with fresh water showers and storage area.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-outside-dining.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Outside Dining\" title=\"Carpe Vita Explorer Maldives Surf Charter Outside Dining\"></p>\n<p>The upper deck and bridge area is where you can accompany the captain while driving the boat. Here you can enjoy the fabulous views from a large sitting area in the shade. In addition, it comprises the beautiful and spacious suite rooms. And the main open-air dining and bar area. Created to enjoy the fine dining prepared by our chef.</p>\n<p>Lastly, there is the sun deck which is partially shaded and has the jacuzzi and lounge chairs to catch a tan.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-meal.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Meals\" title=\"Carpe Vita Explorer Maldives Surf Charter Meals\"></p>\n<h4>The Carpe Vita Explorer has wifi throughout and offers the highest comfort and facilities.</h4>\n<p>The perfect vessel to explore the Maldives, which is a real dive, surf, fishing and cruising paradise.</p>\n<p><img src=\"/images/carpe-vita-explorer-maldives-surf-charter-surfing.jpg\" alt=\"Carpe Vita Explorer Maldives Surf Charter Surfing\" title=\"Carpe Vita Explorer Maldives Surf Charter Surfing\"></p>"},{"url":"/projects/carpe-novo/","relativePath":"projects/carpe-novo.md","relativeDir":"projects","base":"carpe-novo.md","name":"carpe-novo","frontmatter":{"title":"Carpe Novo","subtitle":"Maldives - Fixed/Flexible Schedule - Individual/Group","date":"2020-03-24T13:45:31.354Z","thumb_img_path":"/images/carpe-novo-luxury-surf-charter-yacht-maldives-boat.jpg","content_img_path":"/images/carpe-novo-luxury-surf-charter-yacht-maldives-boat.jpg","template":"project"},"html":"<h3>The Carpe Novo is the bigger and newest boat of the Carpe Diem Cruises fleet.</h3>\n<p>The Carpe Novo was constructed in the Maldives and started sailing in March 2016. There is space for up to 21 guests in 12 cabins, spread over 3 decks. The Carpe Novo is dedicated to surf charters, diving or fishing trips and takes single and group bookings.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-lounge.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives Lounge\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives Lounge\"></p>\n<p>The Carpe Novo has a very spacious main deck. Here you will find the main living areas, which are fully airconditioned. There are a coffee and tea corner, flat screen TV with a media system and a small library. The outside has a shaded sitting area with comfortable cushions.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-dining.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives dining\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives dining\"></p>\n<p>Furthermore, the main deck has a dive equipment room, camera room with battery charging station, storage for luggage and linen, a toilet and the office.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-charging-room.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives charging room\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives charging room\"></p>\n<p>The upper deck comprises the open air restaurant, the bar and the bridge area.</p>\n<p>And finally, the sun deck, where you can relax on one of the many sunbeds. Work on your tan in the sun or unwind in the shade. The best place for your sunset drink.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-sundeck.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives sundeck\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives sundeck\"></p>\n<p>The Carpe Novo has 3 different cabin types. There are 4 junior suites, 2 single suites and 6 standard cabins. They all have individually controlled AC, a safety deposit box, TV and their own private bathroom.</p>\n<p>The junior suites have a king size bed and windows throughout the side of the cabin with a spacious shower. The single suites and standard cabins have queen size beds and all standard cabins have portholes.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-suite.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives Suite\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives Suite\"></p>\n<h4>Trips with the Carpe Novo are all-included.</h4>\n<p>Enjoy a hassle-free trip with full board meals, snacks, drinking water, tea and coffee and guided surfing or diving. The crew will transfer you to the boat and will make sure you can enjoy an unforgettable Maldives experience onboard Carpe Novo.</p>\n<p><img src=\"/images/carpe-novo-luxury-surf-charter-yacht-maldives-bar.jpg\" alt=\"Carpe Novo Luxury Surf Charter Yacht Maldives Bar\" title=\"Carpe Novo Luxury Surf Charter Yacht Maldives Bar\"></p>"},{"url":"/projects/crystal-clear/","relativePath":"projects/crystal-clear.md","relativeDir":"projects","base":"crystal-clear.md","name":"crystal-clear","frontmatter":{"title":"Crystal Clear","subtitle":"Mentawai/Telos/Nias/Banyaks - Fixed Schedule 11d/12n - Individual/Group","date":"2020-03-19T09:24:13.264Z","thumb_img_path":"/images/crystal-clear-surf-charters-sumatra-mentawai-boat.jpg","content_img_path":"/images/crystal-clear-surf-charters-sumatra-mentawai-boat.jpg","template":"project"},"html":"<h3>The Crystal Clear Surf Charter is a power catamaran that can cruise up to 15 knots and will take you to the waves in no time.</h3>\n<p>It has been custom designed for surf trips and offers you guided surf charter trips to the Mentawai Islands, Telos, Nias and Banyak Islands. They are always in search of the best and most uncrowded waves for the day.<br>\n<br>\nYour captain has been surfing the waves around Sumatra since 1989. He is a pioneer in the region and knows where to surf in which conditions as no other. And it is said that he named the famous break ‘Rifles’ !</p>\n<p><img src=\"/images/crystal-clear-surf-charters-sumatra-mentawai-living.jpg\" alt=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks living area\" title=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks living area\"></p>\n<p>The boat usually departs in the evening around 6 pm, depending on arrivals and provisioning. Most importantly, it will travel overnight to get you at the surf in the morning. The tender boat will get you closer to the breaks.</p>\n<p>The Crystal Clear Surf Charter offers space for up to 14 guests or more in 8 single bunk beds, 2 double beds and 2 double private cabins. There are 2 bathrooms and 2 toilets. The boat is fully air-conditioned. And above all, the boat has the latest and necessary safety equipment on board.</p>\n<p><img src=\"/images/crystal-clear-surf-charters-sumatra-mentawai-cabin.jpg\" alt=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks Cabins\" title=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks Cabins\"></p>\n<p>On the main deck level, you find the spacious living area for dining and relaxing. Or enjoy the views and the sun on the partially covered sundeck with comfortable beanbags. In addition, all the usual entertainment equipment is on board, like, music, movies, snorkelling and fishing gear etc…</p>\n<p><img src=\"/images/crystal-clear-surf-charters-sumatra-mentawai-sundeck.jpg\" alt=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks sundeck\" title=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks sundeck\"></p>\n<p>The trips onboard The Crystal Clear Surf Charter are following a fixed schedule and you can join as a group, a single surfer or couple. In low season they offer 10% discount on their rates.</p>\n<h5>INCLUDED:</h5>\n<ul>\n<li>Airport transfers</li>\n<li>Accommodation on board for 11n/12d</li>\n<li>All food and drinks (excl alcohol beverages)</li>\n<li>Use onboard equipment and amenities.</li>\n</ul>\n<h5>NOT INCLUDED:</h5>\n<ul>\n<li>Alcohol ( bring your own duty free or beers for sale on board)</li>\n<li>Airfares</li>\n<li>Travel Insurance (mandatory)</li>\n<li>Mentawai Surfer Tax (IDR 1 Million per person)</li>\n<li>Professional pictures/video &#x26; drone shots ( on request )</li>\n</ul>\n<p><img src=\"/images/crystal-clear-surf-charters-sumatra-mentawai-waves.jpg\" alt=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks waves\" title=\"Crystal Clear Surf Charter Trips to Mentawai, Telos, Nias and Banyaks waves\"></p>"},{"url":"/projects/dhinasha/","relativePath":"projects/dhinasha.md","relativeDir":"projects","base":"dhinasha.md","name":"dhinasha","frontmatter":{"title":"Dhinasha","subtitle":"Maldives - Flexible Dates/Open boat - Individual/Group","date":"2020-03-16T15:16:51.362Z","thumb_img_path":"/images/dhinasha-surf-charter-your-maldives-boat.jpg","content_img_path":"/images/dhinasha-surf-charter-your-maldives-boat.jpg","template":"project"},"html":"<h3>Dhinasha is an award-winning vessel and a perfect choice for your surf charter trip.</h3>\n<p>The crew takes good care of you and will make sure you’ll have an unforgettable Maldives Surf Charter trip. They take you out to the best waves. In between surf sessions, they offer a range of activities like snorkelling, fishing, island visits or a deserted island picnic. </p>\n<p><img src=\"/images/dhinasha-surf-charter-your-maldives-bar.jpg\" alt=\"Dhinasha Surf Charter Boat Your Maldives Bar\" title=\"Dhinasha Surf Charter Boat Your Maldives Bar\"></p>\n<p>There is no fixed schedule so you can book for the dates of your choice. They manage the boat following an 'Open Boat' system, so single surfers can come and go as they wish while the boat keeps on cruising. Or book the boat privately with your group of friends. </p>\n<p><img src=\"/images/dhinasha-surf-charter-your-maldives-cabins.jpg\" alt=\"Dhinasha Surf Charter Boat Your Maldives Cabin\" title=\"Dhinasha Surf Charter Boat Your Maldives Cabin\"></p>\n<p>The boat offers 7 airconditioned cabins with toilet and spacious living areas, sleeping up to 14 surfers maximum. The entire upper level is a lovely sundeck to relax and enjoy the views. The Dhinasha has an indoor and outdoor dining area and the chef onboard will prepare delicious, energising meals. </p>\n<p><img src=\"/images/dhinasha-surf-charter-your-maldives-dining.jpg\" alt=\"Dhinasha Surf Charter Boat Your Maldives Dining\" title=\"Dhinasha Surf Charter Boat Your Maldives Dining\"></p>\n<h3>Trips are all-inclusive with 3 main meals, snacks, water, coffee, tea and more….</h3>\n<p><img src=\"/images/dhinasha-surf-charter-your-maldives-sundeck.jpg\" alt=\"Dhinasha Surf Charter Boat Your Maldives Sundeck\" title=\"Dhinasha Surf Charter Boat Your Maldives Sundeck\"></p>\n<p>Explore the Maldives Atolls and the area of your choice. The owner of Dhinasha will assist you in putting your Maldives trip together and making sure you will return home happy.</p>\n<p><img src=\"/images/dhinasha-surf-charter-your-maldives-surfing.jpg\" alt=\"Dhinasha Surf Charter Boat Your Maldives wave\" title=\"Dhinasha Surf Charter Boat Your Maldives wave\"></p>"},{"url":"/projects/honors-legacy-1/","relativePath":"projects/honors-legacy-1.md","relativeDir":"projects","base":"honors-legacy-1.md","name":"honors-legacy-1","frontmatter":{"title":"Honors Legacy","subtitle":"Maldives - No fixed schedule - Group bookings","date":"2020-03-22T14:01:48.012Z","thumb_img_path":"/images/honors-legacy-surf-charter-boat-sideview.jpg","content_img_path":"/images/honors-legacy-surf-charter-boat-sideview.jpg","template":"project"},"html":"<h3>Breeze to the Maldives surf spots in style with Honors Legacy.</h3>\n<p>A stunning luxury yacht, designed for surf and dive charter trips around the Maldives Atolls. With special attention to detail, it ensures the highest comfort and quality to all guests.</p>\n<p><img src=\"/images/honors-legacy-surf-charter-jacuzzi-sunbeds.jpg\" alt=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls jacuzzi\" title=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls jacuzzi\"></p>\n<p>This luxurious motor yacht meets the highest expectation of passionate water sports enthusiasts. After surfing or diving, you can chill out in the well-positioned jacuzzi and relax on the sun loungers on the top level sun deck. The perfect spot to enjoy the picturesque views out across the Maldivian Indian Ocean. You can even pamper yourself with a spa treatment.</p>\n<p><img src=\"/images/honors-legacy-surf-charter-cabins.jpg\" alt=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls Cabin Suite\" title=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls Cabin Suite\"></p>\n<p>The 33,5-meter long wooden vessel offers 9 modern cabins, accommodating a maximum of 18 guests. There are 2 ocean view suites with en-suite bathroom with a bath. Furthermore, there are six cabins with inter-changeable twin or double beds. And finally one superior twin cabin. All cabins have en-suite bathrooms, air conditioning, a mini-bar, safe and HD TV.</p>\n<p>All necessary safety equipment, like life jackets, fire alarms, first aid kits,….. are onboard.</p>\n<p><img src=\"/images/honors-legacy-surf-charter-outside-dining.jpg\" alt=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls dining\" title=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls dining\"></p>\n<p>Above all, the Honors Legacy has elegantly designed indoor and outdoor dining and lounging areas. The crew of 12, including the captain, chef, barman and spa therapist will make sure you have everything you need.</p>\n<p><img src=\"/images/honors-legacy-surf-charter-lounge-area.jpg\" alt=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls lounge area\" title=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls lounge area\"></p>\n<p>High-quality dining is an essential of a cruise experience. So they bring you lots of variety and different cuisines. With a weekly island BBQ. Snacks, tea and coffee are available 24-hours a day. Meals are served buffet style. Let us know if you have special dietary requirements.</p>\n<p><img src=\"/images/honors-legacy-surf-charter-dining.jpg\" alt=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls meals\" title=\"Honors Legacy luxury motor yacht surf charter for Maldives Atolls meals\"></p>\n<p>Surfing Season with Honors Legacy is from May 1st to September 30th:</p>\n<h4>INCLUDED:</h4>\n<p>– Airport “meet and greet”<br>\n– Return transfer from the airport to the vessel<br>\n– Accommodation (based on 2 sharing)<br>\n– 3 meals per day and snacks<br>\n– Unlimited Drinking water<br>\n– Tea and coffee (instant) throughout the day<br>\n– Dingy transfer from boat to Surf breaks</p>\n<h4>NOT INCLUDED:</h4>\n<p>– Central &#x26; Laamu Atoll Fuel Supplement (=US$ 3000)<br>\n– Dhoni hire (US$250 per day)<br>\n– Surf Guide (US$65 per guide per day)</p>\n<p>Normal check in time: 1300 hrs.<br>\nNormal check out time: 0900 hrs.</p>"},{"url":"/projects/horizon-iii-ocean-oasis/","relativePath":"projects/horizon-iii-ocean-oasis.md","relativeDir":"projects","base":"horizon-iii-ocean-oasis.md","name":"horizon-iii-ocean-oasis","frontmatter":{"title":"Horizon III Ocean Oasis","subtitle":"Maldives - Open boat - Groups min 10 pax","date":"2020-03-21T14:18:54.748Z","thumb_img_path":"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-.jpg","content_img_path":"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-.jpg","template":"project"},"html":"<h3>The Horizon III Ocean Oasis charter boat is here to make your dream charter holiday a reality and cruises at a speed of up to 14 knots.</h3>\n<p>They have over 20’ years of experience in Maldives surf &#x26; dive trips. The captain will take you to the best spots for surfing or diving.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-lounge.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Lounge\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Lounge\"></p>\n<p>The Horizon III Ocean Oasis is a high-quality boat with a focus on comfort and safety. With 12 cabins it can accommodate up to 24 surfers or divers but they can start a private trip with 10 people and prefer to take only 14 guests maximum. <br>\n<br>\nThe boat was built in 2009 and has been renovated in 2015. They have the same award-winning crew for many years. They are committed to providing excellent services to all guests.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-cabins.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Cabins\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Cabins\"></p>\n<p>The Ocean Oasis charter offers you very spacious living areas. It has comfortable leisure decks and an outside jacuzzi. The interior is open and light, giving you a ‘home away from home’ feeling. There is a spa onboard with an experienced Ayurvedic therapist.</p>\n<p>The boat has 3 deluxe and 9 standard cabins with double or single beds ranging from 8 to 20 m2 in size. All cabins have an ensuite bathroom and airconditioning. And you can choose one of the 5 areas onboard to relax. Internet, rental equipment and dive courses are available for an extra fee.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-jacuzzi.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Jacuzzi\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Jacuzzi\"></p>\n<p>Surf and dive trips onboard Horizon III Ocean Oasis are all included. 3 meals per day are provided in buffet style with western and local food. Free tea and coffee and 1,5-litre water per person are provided. We care about coral reef and marine life and try to reduce cans and plastic water bottles.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-meals.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives buffet\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives buffet\"></p>\n<p>The 20-meter tender dhoni is included and can host all the surf or dive equipment. There is a surf or dive guide on board. Local fishing line &#x26; baits are provided. Above that, the SUP is available for your use. Some extra activities, like island hopping, a bbq on a local island, night fishing or city excursion are included, weather permitted.</p>\n<p><img src=\"/images/horizon-iii-ocean-oasis-surf-charter-boat-maldives-dining.jpg\" alt=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Dining\" title=\"Horizon III Ocean Oasis Surf Charter Boat Maldives Dining\"></p>\n<h4>The Horizon III Ocean Oasis is an excellent choice if you want high comfort, extra luxury features and top service!</h4>"},{"url":"/projects/king-millenium-2/","relativePath":"projects/king-millenium-2.md","relativeDir":"projects","base":"king-millenium-2.md","name":"king-millenium-2","frontmatter":{"title":"King Millenium 2","subtitle":"Mentawai/Telos/Nias - Fixed Schedule:11d/12n - Individual/Group","date":"2020-03-21T14:38:30.299Z","thumb_img_path":"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-boat.jpg","content_img_path":"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-boat.jpg","template":"project"},"html":"<h3>King Millenium 2 is a modern catamaran that is fast and comfortable.</h3>\n<p>It was built in Australia and renovated in 2006 to run surf charter trips. There are several destination options; Mentawai, Mentawai and Telos or Telos and Nias, which is including Hinako Island.</p>\n<p>They welcome all levels of surfers. That is to say, they have hosted pro surfers, and groups with a more intermediate or beginner level. The surf guides are super experienced in surfing the area and speak English, French, Spanish, Bahasa Indonesia and Portuguese.</p>\n<p><img src=\"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-waves.jpg\" alt=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias waves\" title=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias waves\"></p>\n<p>The catamaran is 19 meters long with a 7,5-meter beam. It travels at 12 knots cruising speed and can go up to 15 knots. There are 4 spacious cabins for up to 12 guests. Every cabin is airconditioned and has its own TV and DVD. Outdoors are 2 bathrooms.</p>\n<p><img src=\"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-cabins.jpg\" alt=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Cabin\" title=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Cabin\"></p>\n<p>The lounge area is the perfect place to socialise. You can do some Wii gaming, for example, as there are a plasma screen and home cinema system in place. Or just relax in the large couch. From the bow and the deck lounge area, you can enjoy the epic waves or sunset views.</p>\n<p><img src=\"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-lounge.jpg\" alt=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Lounge\" title=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Lounge\"></p>\n<p>Food is a key part of the King Millenium Culture. The chefs prepare Asian and European cuisine with fresh local produce. Therefore the ingredients are sourced from small farmers. Above all, authenticity, health and taste are most important.</p>\n<p>All necessary safety gear is onboard. There are lifejackets and a life raft for 20 people. The jetski is for use of the surf guide, photographers and cameraman. Unless a guest is a seasoned jetski user and has the approval of the guide, it’s not for individual use.</p>\n<p><img src=\"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-interior.jpg\" alt=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Interior\" title=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Interior\"></p>\n<p>The crew and guide have years of experience and will make sure you enjoy an epic trip. Above all, they offer you world-class service. You will enjoy a comfortable and cool environment on board the catamaran. So leave your world behind for an unforgettable surf experience.</p>\n<p><img src=\"/images/king-millenium-2-surf-charter-catamaran-mentawai-telos-nias-decks.jpg\" alt=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Decks\" title=\"King Millenium 2 Surf Charter Catamaran Mentawai Telos Nias Decks\"></p>\n<h4><strong>INCLUDED:</strong></h4>\n<p>• Daily surf coaching and video analysis.<br>\n• The boat trip, 11 surfing days, 12 nights.<br>\n• 3 meals a day, snacks, water, hot drinks, juice, soft drinks.<br>\n• Beer (two per day per passenger).<br>\n• Snorkelling gear, visits to the islands and fishing gear.<br>\n• Transport to &#x26; from: the airport, hotel and boat.<br>\n• All the permits needed to go to Mentawai, Telo and Nias.<br>\n• Single bed in an air-conditioned cabin.<br>\n• First aid kit.<br>\n• Use of the dinghy for surfing, visits and fishing</p>\n<h4><strong>NOT INCLUDED:</strong></h4>\n<p>• Airline tickets.<br>\n• Excess baggage or board fees.<br>\n• Extra costs due to delayed surfboards.<br>\n• Personal travel insurance<br>\n• Indonesian departure tax fee at the airport.<br>\n• Mentawai Surf Tax. US$ 80 to be paid on arrival in Padang.<br>\n• Other meals except as specified above.<br>\n• Alcoholic beverages (available on board at extra cost).<br>\n• Digital photographic and video coverage (available at extra cost): Local photographer and filmer is US$ 200 for photos and US$ 200USD for videos. Both will cost US$300. Professional photographer on request: US$300 for photos and US$200 for video. both services will cost US$400.<br>\n• Transport to Padang in case of emergency (travel insurance recommended).<br>\n• Bank changes.</p>"},{"url":"/projects/maldives-explorer/","relativePath":"projects/maldives-explorer.md","relativeDir":"projects","base":"maldives-explorer.md","name":"maldives-explorer","frontmatter":{"title":"Maldives Explorer","subtitle":"Maldives- Flexible Dates/Open boat - Individual/Group","date":"2020-03-19T13:50:25.085Z","thumb_img_path":"/images/maldives-explorer-surf-charter-boat-.jpg","content_img_path":"/images/maldives-explorer-surf-charter-boat-.jpg","template":"project"},"html":"<h3>The Maldives Explorer is a great surf or dive charter option, completely refurbished in 2018.</h3>\n<p>The Maldives Explorer surf charter boat can take 8 to 16 people in 8 modern air-conditioned cabins. Each cabin has its own bathroom with hot and cold water. There are spacious communal areas for socialising and relaxing. </p>\n<p><img src=\"/images/maldives-explorer-surf-charter-boat-living-area.jpg\" alt=\"Maldives Explorer Charter Boat for surfing and diving around the atolls living areas\" title=\"Maldives Explorer Charter Boat for surfing and diving around the atolls living areas\"></p>\n<p>The Maldives Explorer lounge area has a 32 inch full HD TV with Blu-ray disk player . There are a media library and board games. A karaoke and surround speaker system is available for your entertainment.</p>\n<p><img src=\"/images/maldives-explorer-surf-charter-boat-dining.jpg\" alt=\"Maldives Explorer Charter Boat for surfing and diving around the atolls living areas dining\" title=\"Maldives Explorer Charter Boat for surfing and diving around the atolls living areas dining\"></p>\n<p>The charter boat has multiple alfresco dining areas. There is a resort-qualified chef on board who prepares a variety of dishes with European and Italian influences. The sun deck has a bar, lounge beds and jacuzzi. The bar is well-stocked with a variety of soft drinks, spirits, French wine and beers. . All necessary navigation and safety equipment is on board to guarantee a safe trip.</p>\n<p><img src=\"/images/maldives-explorer-surf-charter-boat-sundeck.jpg\" alt=\"Maldives Explorer Charter Boat for surfing and diving around the atolls sundeck\" title=\"Maldives Explorer Charter Boat for surfing and diving around the atolls sundeck\"></p>\n<h4>INCLUDED:</h4>\n<ul>\n<li>Airport transfers</li>\n<li>3 meals, enough snacks, coffee and tea</li>\n<li>Unlimited purified mineral water</li>\n<li>Visit to a local fishing island</li>\n<li>Sandbank bbq dinner</li>\n<li>Other activities are possible on request</li>\n<li>Wireless internet access.</li>\n</ul>\n<h4>NOT INCLUDED:</h4>\n<ul>\n<li>Alcohol </li>\n<li>Airfares</li>\n<li>Travel insurance ( mandatory! )</li>\n<li>Mentawai Surfer Tax (IDR 1Mill per person)</li>\n<li>Dhoni ( on request!)</li>\n</ul>\n<p><img src=\"/images/maldives-explorer-surf-charter-boat-suite.jpg\" alt=\"Maldives Explorer Charter Boat for surfing and diving around the atolls Cabin\" title=\"Maldives Explorer Charter Boat for surfing and diving around the atolls Cabin\"></p>\n<p>The Maldives Explorer offers surfing, snorkelling, fishing, cruising and diving. On dive trips there is a special dive dhoni, a PADI certified instructor and a PADI certified dive guide. A dhoni for surfing, snorkelling and fishing will be arranged on request.</p>\n<p><img src=\"/images/maldives-explorer-surf-charter-boat-trip.jpg\" alt=\"Maldives Explorer Charter Boat for surfing and diving around the atolls waves\" title=\"Maldives Explorer Charter Boat for surfing and diving around the atolls waves\"></p>"},{"url":"/projects/maldives-legend-i/","relativePath":"projects/maldives-legend-i.md","relativeDir":"projects","base":"maldives-legend-i.md","name":"maldives-legend-i","frontmatter":{"title":"Maldives Legend I","subtitle":"Maldives - No fixed schedule/Open boat - Individual/Group","date":"2020-03-20T14:29:49.910Z","thumb_img_path":"/images/maldives-legend-1-surfcharter-boat-trips-vessel.jpg","content_img_path":"/images/maldives-legend-1-surfcharter-boat-trips-vessel.jpg","template":"project"},"html":"<h3>The Maldives Legend is the newly released and completely refurbished Maldivian Dream charter yacht.</h3>\n<p>That is to say it’s specially designed for surf trips, scuba diving and cruising around the Maldives Atolls. This vessel is the latest addition to the fleet of Maldives Collections, an award-winning organisation. As a result, service quality and satisfaction are guaranteed. </p>\n<p><img src=\"/images/maldives-legend-1-surfcharter-boat-trips-deck.jpg\" alt=\"Maldives Legend 1 Surfcharter Boat Trips Deck\" title=\"Maldives Legend 1 Surfcharter Boat Trips Deck\"></p>\n<p>The experienced crew is ready to assist you with all your requests. So they will make sure you have an excellent surfing and cruising experience.</p>\n<p>There are 11 luxury air-conditioned cabins onboard the Maldives Legend Surf Boat. That is to say, all cabins have an ensuite bathroom with shower and toilet. And there are 3 spacious sea view suites with minibar and bath in the attached bathroom. The Yacht was built in 2015 and refurbished for the 2019 surf season. You can sleep with 11 to 22 pax maximum onboard. Most importantly, the yacht can reach a speed of up to 14 knots.</p>\n<p><img src=\"/images/maldives-legend-1-surfcharter-boat-trips-suite.jpg\" alt=\"Maldives Legend 1 Surfcharter Boat Suite\" title=\"Maldives Legend 1 Surfcharter Boat Suite\"></p>\n<p>The Maldives Legend has all the necessary navigation and communication equipment. In addition, there is internet, which is not the case on all Maldives yachts.</p>\n<p>The Maldives Legend has luxury facilities and a modern interior. Above all, the restaurant and lounge are expansive. There is a variety of games and video library for your entertainment. </p>\n<p><img src=\"/images/maldives-legend-1-surfcharter-boat-trips-lounge.jpg\" alt=\"Maldives Legend 1 Surfcharter Boat Lounge and Dining\" title=\"Maldives Legend 1 Surfcharter Boat Lounge and Dining\"></p>\n<p>The top sun deck offers 20 sunbeds around a jacuzzi. The boat’s bar offers a wide range of wines and liquors. They will stock according to your preferences.</p>\n<p><strong>INCLUDED:</strong></p>\n<ul>\n<li>Airport transfers</li>\n<li>3 meals, enough snacks, coffee and tea</li>\n<li>Unlimited purified mineral water</li>\n<li>Visit to a local fishing island</li>\n<li>Sandbank bbq dinner</li>\n<li>Other activities are possible on request</li>\n<li>Wireless internet access.</li>\n</ul>\n<p><strong>NOT INCLUDED:</strong></p>\n<ul>\n<li>Alcohol</li>\n<li>Airfares</li>\n<li>Travel insurance ( mandatory! )</li>\n<li>Mentawai Surfer Tax (IDR 1Mill per person)</li>\n<li>Dhoni ( on request!)</li>\n</ul>\n<p><img src=\"/images/maldives-legend-1-surfcharter-boat-trips-sundeck.jpg\" alt=\"Maldives Legend 1 Surfcharter Boat Sundeck\" title=\"Maldives Legend 1 Surfcharter Boat Sundeck\"></p>"},{"url":"/projects/melaleuca/","relativePath":"projects/melaleuca.md","relativeDir":"projects","base":"melaleuca.md","name":"melaleuca","frontmatter":{"title":"Melaleuca","subtitle":"Mentawai/Banyaks/Telos - Fixed schedule - Individual/Group","date":"2020-03-11T16:28:03.780Z","thumb_img_path":"/images/melaleuca-surf-charter-boat-mentawai-islands-wave.jpg","content_img_path":"/images/melaleuca-surf-charter-boat-mentawai-islands-wave.jpg","template":"project"},"html":"<h3>Enjoy 80 feet of comfort at the best value in the Mentawais.</h3>\n<p>The Melaleuca boasts traditional Indonesian design with modern amenities. The safety features are as on a western style boat.</p>\n<p>Our western surf guide and Indonesian crew will make sure you get to the best waves and catch fish along the way. Bring up to 12 passengers for 10 full surfing days. Get ready to have the surf trip of a lifetime in the Mentawai islands. We will pick you up at the airport in Padang. And transport you to your transit hotel or the boat depending on what time you arrive.</p>\n<p><img src=\"/images/melaleuca-surf-boat-mentawai-lounge.jpg\" alt=\"Melaleuca Surf Charter Boat Mentawai Islands Lounge Area\" title=\"Melaleuca Surf Charter Boat Mentawai Islands\"></p>\n<p>The main salon of the Melaleuca is equipped with comfortable couches, a bar, a flat screen TV, DVD player and stereo. The separate dining area is a great place to enjoy meals with your friends. 6 individual cabins make for a more luxurious feel than the dorm style boats. The Melaleuca has two, 3 person cabins, three, 2 person cabins and a surf guide cabin. There are two bathrooms. </p>\n<p><img src=\"/images/melaleuca-surf-boat-mentawai-cabins.jpg\" alt=\"Melaleuca Surf Charter Boat Mentawai Islands Cabins\" title=\"Melaleuca Surf Charter Boat Mentawai Islands Cabins\"></p>\n<p>The Melaleuca can reach a cruising speed of up to 12 knot. All necessary safety equipment is on board. Our 20 foot tender will take you to the waves or wherever you want to go.<br>\n<br>\nThe Melaleuca’s exterior is more spacious than any other local boat. The upper deck is huge with a booming stereo that you can hear in the lineup if you like. Half the upper deck is open and half is covered. You get real shade with our hard top. Spread out with 360 degrees of unobstructed views of the waves.</p>\n<p><img src=\"/images/melaleuca-surf-charter-boat-mentawai-islands.jpg\" alt=\"Melaleuca Surf Charter Boat Mentawai Islands\" title=\"Melaleuca Surf Charter Boat Mentawai Islands\"></p>\n<p><br>\nThe fishing station is also covered with a hard top and gives great access to some of the best fishing. Plenty of covered, easy access board storage, an outside shower and swim platform finish off this magnificent, spacious boat.</p>\n<h3>INCLUDED:</h3>\n<ul>\n<li>All transfers to and from Padang airport to your transit hotel and or boat </li>\n<li>Surf package in the Mentawai Islands.</li>\n<li>All meals, snacks, juices, soft drinks and coffee on vessel.</li>\n<li>3 ice cold beers a day. </li>\n</ul>\n<h3>NOT INCLUDED:</h3>\n<ul>\n<li>Airfare to and from Padang, Sumatra, Indonesia.</li>\n<li>Visa fees on arrival.</li>\n<li>Hotel in Padang.</li>\n<li>Meals off vessel.</li>\n<li>Airport taxes.</li>\n<li>Excess baggage fees.</li>\n<li>Passport, inoculation costs. </li>\n<li>Mentawai Government Tax of 1,000,000 Rupiah/person.</li>\n<li>Photography Service.</li>\n<li>Personal tips for the onboard crew (We recommend USD$100 per crew member and normally there are 6 crew members so USD$600 in total). The crew also loves board shorts, t-shirts and surf gear with their tips.</li>\n<li>Travel Insurance (Mandatory if you book a charter boat trip!)</li>\n</ul>\n<p><img src=\"/images/melaleuca-surf-charter-boat-mentawai-islands-meals.jpg\" alt=\"Melaleuca Surf Charter Boat Mentawai Islands Meals\" title=\"Melaleuca Surf Charter Boat Mentawai Islands Meals\"></p>\n<h3><em>CLIENT FEEDBACK:</em></h3>\n<p><strong><em>Gee, April 2019:</em></strong><br>\n“This was my third trip to Mentawaii and was definitely the best to date. We had amazing waves and our guide made sure all the party had waves for their ability and generally un-crowded. The crew were fantastic and the boat was great. Nothing seemed like too much trouble and they were always smiling. Lastly, I would like to thank you. Throughout the whole process, LTL Surf Charters has always responded to my emails with answers promptly and made me feel comfortable I was booking with a reputable company. If I could offer one piece of feedback it would be for some more comfortable seating on deck but this did not affect our enjoyment it’s just something that would only enhance what is a great boat. I don’t believe the crew and guide could have been any better.Thanks again.”</p>\n<p><img src=\"/images/melaleuca-surf-charter-boat-mentawai-islands-surfing.jpg\" alt=\"Melaleuca Surf Charter Boat Mentawai Islands surfer\" title=\"Melaleuca Surf Charter Boat Mentawai Islands surfer\"></p>"},{"url":"/projects/moon-palikir/","relativePath":"projects/moon-palikir.md","relativeDir":"projects","base":"moon-palikir.md","name":"moon-palikir","frontmatter":{"title":"Moon Palikir","subtitle":"Mentawai/Telos - Fixed schedule12n -Individual/Group","date":"2020-03-15T08:58:41.171Z","thumb_img_path":"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-boat.jpg","content_img_path":"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-boat.jpg","template":"project"},"html":"<h3>The Moon Palikir surf charter takes you to surf the best waves in Mentawai or around the Telos Islands.</h3>\n<p>We choose to concentrate on 1 area to maximize the surf time and limit the time wasted sailing. They will go the extra mile to make sure you have an unforgettable experience.</p>\n<p><img src=\"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-waves.jpg\" alt=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands waves\" title=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands\"></p>\n<p>The vessel features 6 airconditioned cabins and accommodates 12 surfers maximum. The Moon Palikir feels like a home with enough personal space and a tasteful interior. </p>\n<p><img src=\"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-cabins.jpg\" alt=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Cabins\" title=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Cabins\"></p>\n<p>You can relax on the spacious decks or enjoy the entertainment area in the lounge.</p>\n<p><img src=\"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-interior.jpg\" alt=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Entertaining\" title=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Entertaining\"></p>\n<p>Group booking &#x26; Early booking Specials are available. Low Season Rates valid Jan-March and Oct-Nov.</p>\n<p><img src=\"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-food.jpg\" alt=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Meals\" title=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Meals\"></p>\n<h4>INCLUDED:</h4>\n<p>– All airport/boat/transfers in Padang<br>\n– On-board air-con cabin accommodation<br>\n– Chef made meals in diversified menu<br>\n– Fruits, snacks, soft drinks, mineral water<br>\n– 15 cartons of Bintang beer per charter<br>\n– 18ft Speedboat, 12ft tender boat<br>\n– Fishing and snorkelling gear<br>\n– Experienced surf guide on board</p>\n<h4>NOT INCLUDED:</h4>\n<p>– Photo and Video services (on request)<br>\n– Indonesia VISA (check your country requirements)<br>\n– Mentawai TAX (1 million rupiah = about USD$70)<br>\n– Airline tickets<br>\n– Travel Insurance<br>\n– Extra alcohol (on request)</p>\n<p><img src=\"/images/moon-palikir-surf-charter-trips-mentawai-telos-islands-surf.jpg\" alt=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Girls\" title=\"Moon Palikir Surf Charter Trips Mentawai or Telos Islands Girls\"></p>"},{"url":"/projects/nusa-dewata/","relativePath":"projects/nusa-dewata.md","relativeDir":"projects","base":"nusa-dewata.md","name":"nusa-dewata","frontmatter":{"title":"Nusa Dewata","subtitle":"Mentawai /Telos - Fixed Schedule - Individual / Group Bookings","date":"2020-03-06T16:20:02.520Z","thumb_img_path":"/images/mentawai-surf-charter-nusa-dewata-boat.jpg","content_img_path":"/images/mentawai-surf-charter-nusa-dewata-boat.jpg","template":"project"},"html":"<p>The Nusa Dewata Surf Charter Boat takes you on an 11 nights surf charter trip to the Mentawai Islands and Telos on request.</p>\n<h3>They specialise in small groups of up to 6 pax. Single bookings are possible.</h3>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-vessel.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands\"></p>\n<p>The Nusa Dewata is one of the first timber boats built in Indonesia. It has been lengthened, widened and renovated for surfing trips. The boat is featured in different magazines and videos. The boat uses its sails when there is wind for more stability and economy. Therefore it makes it one of the prettiest boats around. Cruising speed is 8 knots.</p>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-dingy.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Dingy\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Dingy\"></p>\n<h4>They have a fixed schedule of 11 nights with 10 days of surfing or longer on request.</h4>\n<p>The owner guides himself on most of the trips. The dorm style accommodation is fully airconditioned with widened bottom bunk beds. There is a marine toilet with shower. The outdoor shower is perfect for after the surf.</p>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-cabin.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Rooms\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Rooms\"></p>\n<p>The aluminium speedboat takes you to the waves or out fishing or snorkelling. There is game fishing and snorkelling gear available. There is a TV with a DVD player on board, an iPod and a laptop computer. A 15 man life raft and all necessary equipment for your safety are onboard.</p>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-captain.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Captain\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Captain\"></p>\n<h3>The Nusa Dewata Surf Charter Boat is very well maintained and the engine has been rebuilt.</h3>\n<p>The boat is cleaned and painted every year. In other words, the owners are very fanatical about the upkeep and maintenance. The Nusa Dewata has a full teak interior. There is lots of shaded outside deck area to relax in between surf sessions.</p>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-deck.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Decks\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Decks\"></p>\n<p>Surf Charter trips onboard Nusa Dewata are all included. That is to say they provide 3 beers and meals per day with water, sodas and snacks. The chef will prepare tasty Indonesian and western dishes. A free t-shirt, beer cooler and stickers are extra.</p>\n<p><img src=\"/images/mentawai-surf-charter-nusa-dewata-meals.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Meals\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Meals\"></p>\n<p>And free surf coaching and sailing coaching are available for those who want. A photo CD is available for US$ 70. You can order extra beer up front and short golfing tours can be arranged. Departure tax and tips for the crew are not included in the trip rate. The crew is very disciplined and will make sure you experience a fantastic surf trip.</p>\n<p><img src=\"/images/nusa-dewata-surf-charter-mentawai-islands-surfing.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Waves\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Waves\"></p>\n<h3>INCLUDED:</h3>\n<ul>\n<li>Transport from and to airport</li>\n<li>11 nights onboard Nusa Dewata </li>\n<li>All meals, snacks, water, soft drinks, coffee and tea</li>\n<li>3 beers/day/person</li>\n<li>Fishing, snorkelling, dingy with 100 hp, paddle boards, diving equipment and all facilities onboard</li>\n</ul>\n<h3>NOT INCLUDED:</h3>\n<ul>\n<li>Airfares</li>\n<li>Mentawai Tax</li>\n<li>tips for crew</li>\n<li>more beers, please request upfront</li>\n</ul>\n<p>Plan to arrive on the first day of the scheduled charter trip dates, the boat departs in the evening Nusa Dewata will return early morning of the last day of the charter trip dates</p>\n<p><img src=\"/images/nusa-dewata-surf-charter-mentawai-islands-surfing.jpg\" alt=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Air\" title=\"Nusa Dewata Surf Charter Boat Mentawai and Telos Islands Air\"></p>"},{"url":"/projects/ocean-dreams/","relativePath":"projects/ocean-dreams.md","relativeDir":"projects","base":"ocean-dreams.md","name":"ocean-dreams","frontmatter":{"title":"Ocean Dreams","subtitle":"Mentawai/Telos/Nias - Semi-Fixed Schedule - Individual/Group","date":"2020-03-16T16:39:46.449Z","thumb_img_path":"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-decks.jpg","content_img_path":"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-decks.jpg","template":"project"},"html":"<h3>The Ocean Dreams Surf Charter is specially designed for surfers. It’s locally built in West Sumatra.</h3>\n<p>The boat has all modern amenities and safety features. Therefore they can guarantee a comfortable surf charter trip. So you can enjoy 11 to 15 nights onboard. They take a minimum of 8 surfers and up to 14 guests maximum in 3 airconditioned cabins.</p>\n<p><img src=\"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-cabins.jpg\" alt=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands Cabins\" title=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands Cabins\"></p>\n<p>The Ocean Dreams Surf Charter crew runs charters mainly to the Mentawai Islands. Because it’s simply the most consistent area of the outer islands. We can also put together special trips to some lesser known surf spots like Telos or Nias. Ocean Dreams cruises at 8 to 10 knots and can sail up to 12 knots.</p>\n<p><img src=\"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-lounge.jpg\" alt=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands\" title=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands\"></p>\n<p>The boat offers 3 separate sleeping quarters with air conditioning. There are 2 private bathrooms and an outside shower. Each bunk bed offers a private personal space for a surfer. That is to say, with personal reading light, dimmer switch and charging station. The communal area has a large main salon with a led projector. Further a spacious covered top deck for relaxing and enjoying the surf and sunset views.</p>\n<p><img src=\"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-sushi.jpg\" alt=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands lounge\" title=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands lounge\"></p>\n<p>You will be served a mix of western and Indonesian food by a top local chef with international experience. Snacks and special requests are available throughout the day. And you can buy alcoholic drinks at the bar or bring your favourite from the airport.</p>\n<p><img src=\"/images/ocean-dreams-surf-charters-mentawai-telos-nias-islands-wave.jpg\" alt=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands Waves\" title=\"Ocean Dreams Surfing Charter in Mentawai Telos or Nias Islands Waves\"></p>"},{"url":"/projects/ocean-divine/","relativePath":"projects/ocean-divine.md","relativeDir":"projects","base":"ocean-divine.md","name":"ocean-divine","frontmatter":{"title":"Ocean Divine","subtitle":"Maldives Atolls - Surf/Dive Schedule - Individual/Group","date":"2020-03-12T10:19:15.522Z","thumb_img_path":"/images/ocean-divine-luxury-surf-charter-yacht-maldives-boat.jpg","content_img_path":"/images/ocean-divine-luxury-surf-charter-yacht-maldives-boat.jpg","template":"project"},"html":"<h3>Ocean Divine is one of the most luxurious vessels in Maldives.</h3>\n<p>David and Gaelle, the french owners, are on board and offer you a different experience. They provide a 5-star service. They work with a fixed schedule of 7-day trips in surfing season and 7- to 10-day trips for diving.</p>\n<p><img src=\"/images/ocean-divine-luxury-surf-charter-yacht-maldives-lounge.jpg\" alt=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Lounge\" title=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives  Lounge\"></p>\n<p>David is an experienced free-diver, keen surfer and scuba diving instructor. And he has been living in Maldives since 1990. They learn you breathing and relaxation techniques and how to hold your breath longer under water. Diving courses are available on request and they organise dive trips from November to April.</p>\n<p>Surf trips are organised from May to October. Spoil yourself to an unforgettable surf charter trip onboard Ocean Divine. Many guests return over and over again. We have Australian surf guides on board that will select the best surf spots for the day, taking notice of all weather conditions.</p>\n<p><img src=\"/images/ocean-divine-luxury-surf-charter-yacht-maldives-suite.jpg\" alt=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Suite\" title=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Suite\"></p>\n<p>The Ocean Divine’s accommodation consists of 7 cabins with individual controlled air-conditioning. All cabins have a full queen size plus a single bed and comfortable ensuite bathrooms. Each cabin has its own plasma screen with dvd player. Fresh bath towels, bathrobes and toiletries are provided.</p>\n<p><img src=\"/images/ocean-divine-luxury-surf-charter-yacht-maldives-sunbeds.jpg\" alt=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Sunbeds\" title=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives  Sunbeds\"></p>\n<p>Ocean Divine has a tender and dingy. You can decide when you want to surf and do what you like all day long. The crew are there for you 24/7. Other activities besides surfing are fishing, snorkeling, SUP and diving. Or just relax, play games or get spoiled at the Spa with a massage, reflexology or shiatsu. We also organise a visit to a local island, sunset cocktails and photo / video viewings of your trip. </p>\n<p><img src=\"/images/ocean-divine-luxury-surf-charter-yacht-maldives-meals.jpg\" alt=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Cuisine\" title=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives  Cuisine\"></p>\n<p>The first class chef on board prepares international cuisine and  top local specialties with the freshest local and imported ingredients. If you have special dietary requests, let us know. Ocean Divine brings you lots of variation, which is not always the case on other local surf charter boats. Another thing where Ocean Divine is different and more luxury…</p>\n<p><img src=\"/images/ocean-divine-luxury-surf-charter-yacht-maldives-sup.jpg\" alt=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Wave\" title=\"Ocean Divine Luxury Surf Yacht Charter Boat Maldives Wave\"></p>\n<h4>INCLUDED (Surf Trips):</h4>\n<ul>\n<li>Return airport transfers</li>\n<li>Tourism taxes</li>\n<li>Air-Conditioned twin share cabin with ensuite bathroom</li>\n<li>All meals and non-alcoholic beverages, incl hot drinks</li>\n<li>Use of all on board equipment (for snorkelling)</li>\n<li>Services of expert guides (surf and dive guides)</li>\n<li>Fishing from the Dhoni</li>\n<li>Visit to local island</li>\n</ul>\n<h4>NOT INCLUDED (Surf Trips):</h4>\n<ul>\n<li>Alcoholic beverages</li>\n<li>Massage</li>\n<li>Diving</li>\n<li>Internet</li>\n<li>Diving course (on request: 130$/pers )</li>\n</ul>"},{"url":"/projects/orca-laut/","relativePath":"projects/orca-laut.md","relativeDir":"projects","base":"orca-laut.md","name":"orca-laut","frontmatter":{"title":"Orca Laut","subtitle":"Mentawai - Fixed Schedule 10d/11n - Group and single bookings","date":"2020-02-27T16:10:57.055Z","thumb_img_path":"/images/orca-laut-surf-charter-mentawai-david-burden-photo-14.jpg","content_img_path":"/images/orca-laut-surf-charter-mentawai-david-burden-photo-14.jpg","template":"project"},"html":"<p>The Orca Laut has a steel hull and deck with a Detroit 671 Diesel engine. With 3 airconditioned cabins and 8 berths, it can accommodate up to 8 surfers for an unforgettable surf trip around the Mentawai Islands. All the necessary safety equipment is on board to guarantee a safe trip.</p>\n<p><img src=\"/images/orca-laut-surf-charter-mentawai-david-burden-photo-17.jpg\" alt=\"Orca Laut Surf Charter Mentawai Surfing Trip Group\" title=\"Orca Laut Surf Charter Mentawai Surfing Trip Group\"></p>\n<p>The team consists of locals and westerners with an unrivalled experience and they make sure you can enjoy a worry-free and unforgettable surf charter trip in Mentawai Sumatra, Indonesia. The trip is all-inclusive and they take care of you from your arrival at Padang Airport until you take your flight back home.</p>\n<p><img src=\"/images/orca-laut-surf-charter-mentawai-david-burden-photo-18.jpg\" alt=\"Orca Laut Surf Charter Mentawai Surfing wave David Burden Photography\" title=\"Orca Laut Surf Charter Mentawai Surfing wave David Burden Photography\"></p>\n<p>In between surf sessions you can relax on the sundeck of the boat or in the airconditioned living area with an entertainment corner. There is equipment on board to enjoy some snorkelling and fishing.</p>\n<p>The trips are 11 nights / 10 days all-included, following a fixed schedule from February to October. You can book with a group and they also take single bookings to fill up the boat. Ask for the specials and bodyboard trips with ex legend boogers Garth Mcgegror n Adam Wingnut Smith.</p>\n<p><img src=\"/images/orca-laut-surf-charter-mentawai-david-burden-photo-8.jpg\" alt=\"Orca Laut Surf Charter Trip Mentawai Food\" title=\"Orca Laut Surf Charter Trip Mentawai Food\"></p>\n<h2>INCLUDED:</h2>\n<p>– Transfers to and from Padang Airport to the boat ( fly anytime in and out on the date of your charter)<br>\n– daily breakfast, lunch and dinner<br>\n– snacks<br>\n– 5 Bintang beers per guest per day, soft drinks, mineral water – use of all amenities and equipment ( fishing, snorkelling, pay as you go internet,… ) – use of tin boats (60 hp) and 10hp for surfing and fishing</p>\n<h2><strong>EXTRAS on request at fee:</strong></h2>\n<p>– more beers, wine, spirits <br>\n– massage <br>\n…</p>\n<p><img src=\"/images/orca-laut-surf-charter-mentawai-david-burden-photo-2.jpg\" alt=\"Orca Laut Surf Charter Mentawai Surfing wave David Burden Photography\" title=\"Orca Laut Surf Charter Mentawai Surfing wave David Burden Photography\"></p>"},{"url":"/projects/sibon-baru/","relativePath":"projects/sibon-baru.md","relativeDir":"projects","base":"sibon-baru.md","name":"sibon-baru","frontmatter":{"title":"Sibon Baru","subtitle":"Mentawai/Telos/Banyaks - Fixed Schedule: 11d/12n - Individual/Group","date":"2020-03-20T15:02:06.593Z","thumb_img_path":"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks.jpg","content_img_path":"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks.jpg","template":"project"},"html":"<h3>The Sibon Baru catamaran was designed in Indonesia to run surf charter trips around the Islands in Sumatra.</h3>\n<p>It cruises at 10 knots and can reach up to 15. The crew is awesome and the chef excellent.</p>\n<p>There are 2 route options. The north route going to Banyaks, Telos, Nias,… and up to the Playgrounds area in Mentawai. Or the Mentawai route from Playgrounds up to South Mentawais. Combining both routes is possible for an additional fuel cost.</p>\n<p><img src=\"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks-waves.jpg\" alt=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks waves\" title=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks waves\"></p>\n<p>The Sibon Baru Catamaran has 5 cabins with air-conditioning and 3 bathrooms, sleeping up to 12 guests. The dining and lounging areas are spacious and comfortable. The upper rear deck is the best spot to check the surf and enjoy an ice-cold sunset drink from your comfortable bean-bag.</p>\n<p><img src=\"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks-cabins-.jpg\" alt=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Cabins\" title=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Cabins\"></p>\n<p>The catamaran is fully equipped with everything you need for a safe and worry-free trip. There is a desalinator installation for fresh water, medical and first aid kit. The satellite phone, life raft and lifejackets are there in case of an emergency.</p>\n<p><img src=\"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks-sundeck.jpg\" alt=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks sundeck\" title=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks sundeck\"></p>\n<p>The crew will transfer you from the airport to the boat. You will leave the harbour during the evening of the first day, so you can have your first surf session in the morning. You will return in the early morning of the last day of the trip, to catch your flight back home.</p>\n<p><img src=\"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks-lounge-area.jpg\" alt=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Lounge\" title=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Lounge\"></p>\n<h3>INCLUDED:</h3>\n<p>– 12 nights / 11 days of stay aboard of Sibon Baru<br>\n– Padang Airport to/from Boat Transfers <br>\n– Three gourmet meals per day<br>\n– complimentary snacks and fruits<br>\n– Drinking water, isotonic, hot drinks, juices, soft drinks<br>\n– One 24-pack of the best local beer per guest.<br>\n– Use of equipment &#x26; amenities: SUP, snorkel/fishing gear and speedboats</p>\n<h3>NOT INCLUDED:</h3>\n<p>– Photo Service (always available USD 300/person)<br>\n– Mentawaii Surfer Tax (about USD 80 per surfer)<br>\n– Airline tickets<br>\n– Travel Insurance ( make sure you have one ! )<br>\n– Alcoholic Drinks other than the Bintang beer described above\\ (A wine/spirits list can be forwarded to purchase specific wines and spirits for you. A min of 60 days notice is required for specific orders.)</p>\n<p><img src=\"/images/sibon-baru-surf-charter-catamaran-mentawai-telos-banyaks-sunset.jpg\" alt=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Sunset\" title=\"Sibon Baru Surf Charter Catamaran Mentawai Telos Banyaks Sunset\"></p>\n<h3>Sibon Charters will guide you to surf the best waves in the world with perfect service by the crew so you can enjoy a dream surf trip.</h3>"},{"url":"/projects/sibon-jaya/","relativePath":"projects/sibon-jaya.md","relativeDir":"projects","base":"sibon-jaya.md","name":"sibon-jaya","frontmatter":{"title":"Sibon Jaya","subtitle":"Mentawai/Telos/Banyaks - Fixed Schedule: 11d/12n - Individual/Group","date":"2020-03-19T14:27:23.331Z","thumb_img_path":"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips.jpg","content_img_path":"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips.jpg","template":"project"},"html":"<h3>Sibon Jaya is a luxurious 70-foot catamaran, specially built for surf charter trips.</h3>\n<p>They take up to 12 surfers maximum. You can book the boat privately or join as a small group or single surfer. The catamaran offers exceptional comfort and luxury amenities. And provides stability, speed and smooth sailing. This surf charter yacht brings an unparalleled surf experience in Mentawai islands and beyond.</p>\n<p><img src=\"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips-dining-lounge.jpg\" alt=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond living areas\" title=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond living areas\"></p>\n<p>Firstly, the Sibon Jaya catamaran is very spacious with large windows, therefore giving spectacular views across the living areas. It cruises at a speed of up to 13 knots with the latest lightweight eco-efficient motors. There are 4 solar panels to provide electricity.</p>\n<p><img src=\"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips-suite.jpg\" alt=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond suite\" title=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond suite\"></p>\n<p>Secondly, this surf charter boat is fully air-conditioned and has fans and thermal insulation throughout. You feel like staying in a 5-star hotel with luxury bedding on the comfy beds. There are 4 cabins with each its private bathroom with shower and toilet. The 5th cabin has a private bathroom outside the room. All hatches have a blackout curtain and mosquito nets. All walls and doors are sound insulated.</p>\n<p><img src=\"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips-relaxing.jpg\" alt=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond outside lounge\" title=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond outside lounge\"></p>\n<p>Further, the rear upper deck is perfect for relaxing after the surf. From the comfy couches, you can enjoy your sunset drinks while taking in the breathtaking views.</p>\n<p>You have easy access to the water through the swim platform. So you can use the fishing and snorkelling equipment. In addition, there is a Stand-Up Paddle and Kayak on board. And a 42’ LCD TV with DVD and sound system for your entertainment. The catamaran has a 20 person emergency raft and all necessary equipment for your safety.</p>\n<p><img src=\"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips-deck.jpg\" alt=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond swim platform\" title=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond swim platform\"></p>\n<p>There are 2 route options. You can decide on the north route which includes the surf spots in the north like Telos, Banyaks, Nias,… up to Playgrounds in Mentawais. Or you can surf the Mentawais from Playgrounds up to South Mentawais ( Sendings). If you want to do both routes there is an additional fuel supplement.</p>\n<h4>INCLUDED:</h4>\n<ul>\n<li>Padang Airport Transfers</li>\n<li>12 nights / 11 days Accommodation</li>\n<li>Use of boat's equipment and amenities</li>\n<li>3 gourmet meals per day</li>\n<li>Snacks and fruits </li>\n<li>drinking water, isotonic, hot drinks, juices, and soft drinks</li>\n<li>24-pack of the best local beer per guest</li>\n<li>Stand up paddle board, snorkel, fishing gear and speedboats</li>\n</ul>\n<h4>NOT INCLUDED:</h4>\n<ul>\n<li>Airfares</li>\n<li>Mentawai Surfer Tax</li>\n<li>Other alcoholic drinks (order up front)</li>\n<li>Professional photos/video (on request)</li>\n</ul>\n<p><img src=\"/images/sibon-jaya-luxury-surf-catamaran-charter-boat-mentawai-telos-and-nias-trips-cuisine.jpg\" alt=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond gourmet food\" title=\"Sibon Jaya luxury surf catamaran charter boat Mentawai and beyond gourmet food\"></p>\n<h4>In conclusion, if you are looking for an unforgettable and luxury surf charter trip, Sibon Jaya is the yacht for you.</h4>"},{"url":"/projects/sola-gracia/","relativePath":"projects/sola-gracia.md","relativeDir":"projects","base":"sola-gracia.md","name":"sola-gracia","frontmatter":{"title":"Sola Gracia","subtitle":"Mentawai/Telos- Fixed Schedule: 10d/11n, Individual/Group","date":"2020-03-23T11:42:34.291Z","thumb_img_path":"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-vessel.jpg","content_img_path":"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-vessel.jpg","template":"project"},"html":"<h3>The Sola Gracia is a luxurious surf charter vessel offering you the ultimate experience.</h3>\n<p>The boat offers you space and comfort and brings you at the waves in safety, with stability and a speed of 8 to 12 knots.</p>\n<p>You can enjoy spectacular views over the ocean through the large windows in the dining and living areas. There is air-conditioning throughout. </p>\n<p><img src=\"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-lounge.jpg\" alt=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands lounge\" title=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands lounge\"></p>\n<p>With its 3 cabins, sleeping 4 people each, Sola Gracia can accommodate groups up to 12 people maximum. They need 8 guests minimum to start a trip. Exclusive group charters and non-exclusive charters with different smaller groups are possible.<br>\n<br>\nThe cabins offer comfortable mattresses with high-quality linens and a reading light for each guest. There are international power outlets of 220V.</p>\n<p><img src=\"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-cabins.jpg\" alt=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands Cabin\" title=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands Cabin\"></p>\n<p>The outside decks of the boat are spacious with beanbags and sofas, so guests can relax in comfort while watching the surf. A perfect spot to have a cold beer while enjoying beautiful sunset views after the surf.</p>\n<p>Sola Gracia can take you to the Mentawai Islands, Telos or Banyak. Mentawai is the most popular region with waves year-round and peak season from March to November. With 91% chance on epic waves and warm water, this area has it all.</p>\n<p><img src=\"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-surf.jpg\" alt=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands waves\" title=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands waves\"></p>\n<p>Telos consists of 51 islands with more untouched areas and secret waves. Waves here are in general more mellow and the beaches are idyllic. Banyaks, north of Nias, has a variety of world-class waves. This area is becoming popular and there is more exploring to be done.</p>\n<p><img src=\"/images/sola-gracia-mentawaisurfco-surf-charter-boat-mentawai-islands-cruising.jpg\" alt=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands\" title=\"Sola Gracia Mentawaisurfco Surf Charter Boat Mentawai Islands\"></p>\n<h3>INCLUDED:</h3>\n<p>– Airport transfers<br>\n– Accommodation<br>\n– Breakfast, lunch and dinner.<br>\n– All snacks<br>\n– 10 cases of Bintang per trip<br>\n– unlimited filtered water, soft drinks and hot beverages.<br>\n– Use of fishing, snorkelling, speargun equipment<br>\n– Excursions.<br>\n– All necessary zone permits.</p>\n<h3>NOT INCLUDED:</h3>\n<p>– Mentawai Surfer Tax (AUD$ 100/pax)<br>\n– Photography service<br>\n– Flights to and from Padang<br>\n– Hotel in Padang if required<br>\n– Visa Fees and Departure Tax<br>\n– The cost resulting from late arrival / early departure<br>\n– Other alcoholic beverages</p>\n<h3>EXTRAS:</h3>\n<p>– Extra nights: +AU$300 pp per night.<br>\n– Photography service (Bring your own USB)<br>\n– Extra carton of Bintang/Anker beer @ AU$45</p>\n<h3>IMPORTANT:</h3>\n<p>Surfers should arrive in Padang on the first day of the scheduled charter dates. The ground crew will welcome you and collect the Mentawai Government Tax ( approx $ 115) and supply your ticket and wrist band, necessary to surf in Mentawai. You will be transferred directly to the Sola Gracia from 3 PM, where you will wait for the rest of the group. The boat departures when all the guests have arrived. They travel overnight, so you can have your first surf session the next morning. Check out on the last return day to Padang is 10 am, after breakfast, when you will be transferred to the airport.</p>\n<h4>Make sure you have valid surf travel insurance!</h4>"},{"url":"/projects/star-koat-2/","relativePath":"projects/star-koat-2.md","relativeDir":"projects","base":"star-koat-2.md","name":"star-koat-2","frontmatter":{"title":"Star Koat 2","subtitle":"Mentawai/Banyaks/Hinako  - Fixed schedule- Individual/Group","date":"2020-03-13T14:57:26.607Z","thumb_img_path":"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands.jpg","content_img_path":"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands.jpg","template":"project"},"html":"<h3>The Star Koat 2 is a surf boat thought thru in every single detail.</h3>\n<p>It offers surfer guests the ultimate level in comfort and style on board their surf charter trip in search of unexplored waves. Everything is taken care of and the boat is equipped with all necessary navigation and safety gear.</p>\n<p><img src=\"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands-trip-crew.jpg\" alt=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Captain\" title=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip  Captain\"></p>\n<p>Star Koat 2 is now based in the archipelago of Banyaks, North Sumatra. A great option if you want to be off the beaten track with fewer crowds and plenty of world class surf spots. This archipelago offers incredible waves, many only accessible by boat. The experienced surf guide on board will make sure you’ll be at the right spot every day.</p>\n<p><img src=\"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands-trip-cabin.jpg\" alt=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Cabins\" title=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip  Cabins\"></p>\n<p>Star Koat 2 has 6 cabins, designed for fitting two guests each, in individual single beds, and each room has its own airconditioning. You will find enough plugs to charge all your devices at the side of your bed and your own cabinet to store your personal items.</p>\n<p><img src=\"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands-trip-lounge.jpg\" alt=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Lounge\" title=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Lounge\"></p>\n<p>The living room was made to host everyone in great comfort and style with a large dining table and a huge lounge sofa to chill out and recover from the sun and surf. Equipped with 50″ LCD TV and other gadgets for the guests’ entertainment.</p>\n<p><img src=\"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands-trip-bar.jpg\" alt=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Food\" title=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Food\"></p>\n<h4>INCLUDED:</h4>\n<ul>\n<li>All airport/boat/transfers in Padang</li>\n<li>On-board air-con cabin accommodation</li>\n<li>Chef made meals in diversified menu </li>\n<li>Fruits, snacks, soft drinks, mineral water</li>\n<li>15 cartons of Bintang beer per charter</li>\n<li>18ft Speedboat, 12ft tender boat</li>\n<li>fishing &#x26; snorkeing gear and SUP</li>\n<li>Experienced surf guide on board</li>\n</ul>\n<h4>NOT INCLUDED:</h4>\n<ul>\n<li>Photo and Video services (on request)</li>\n<li>Indonesia VISA (check your country requirements)</li>\n<li>Mentawai TAX. (1 million rupiah = about USD$70)</li>\n<li>Airline tickets</li>\n<li>Travel Insurance </li>\n<li>Extra alcoholic drinks (on request)</li>\n</ul>\n<p><img src=\"/images/star-koat-2-surf-charter-mentawai-banyaks-hinako-islands-trip-fishing.jpg\" alt=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip Fishing\" title=\"Star Koat 2 Surf Charter Mentawai Banyaks Hinako Islands Trip  Fishing\"></p>\n<h4>Boat Specifications:</h4>\n<p>Length Overall (LOA): 35m<br>\nBean: 6.5 m<br>\nConstruction: Fiberglass Hull<br>\nMarine Engine: Twin Engine Nissan RF10 420HP<br>\nTop speed: 15 Knots<br>\nCruise speed: 12 knots<br>\nGenerator: 2 x colt diesel PS100 40KW<br>\nElectrical points: 220v power<br>\nRegistration: Indonesian Flag<br>\n18-foot speedboat/engine 115 HP<br>\n12-foot tender/engine 15HP</p>"},{"url":"/projects/tengirri/","relativePath":"projects/tengirri.md","relativeDir":"projects","base":"tengirri.md","name":"tengirri","frontmatter":{"title":"Tengirri","subtitle":"Mentawai/Telos - Fixed schedule: 11d/12n - Individual/Group","date":"2020-03-12T15:05:24.422Z","thumb_img_path":"/images/tengirri-mentawai-surf-charter-power-catamaran-boat.jpg","content_img_path":"/images/tengirri-mentawai-surf-charter-power-catamaran-boat.jpg","template":"project"},"html":"<h3>The Tengirri Mentawai Surf Charter is a fully air-conditioned catamaran powerboat.</h3>\n<p>The charter is equipped for a maximum of 8 surfers. You can book as a single or with your group of friends. They also take fishermen and have a large selection of fishing equipment.</p>\n<p><img src=\"/images/tengirri-mentawai-surf-charter-power-catamaran-interior.jpg\" alt=\"Tengirri Surf Charter Power Catamaran Mentawai Interior\" title=\"Tengirri Surf Charter Power Catamaran Mentawai  Interior\"></p>\n<p>The boat offers 6 cabins and travels at up to 17 knots at night, so you are at the best waves during the day. So you can enjoy unlimited surfing, fishing and snorkelling.</p>\n<p>They offer a wide variety of entertainment with magazines, books and movies. The equipment includes a flat-screen TV, media player, iPod compatible stereo and satellite phone at 5$/minute. Email is not available.</p>\n<p><img src=\"/images/tengirri-mentawai-surf-charter-power-catamaran-cabin.jpg\" alt=\"Tengirri Surf Charter Power Catamaran Mentawai Cabin\" title=\"Tengirri Surf Charter Power Catamaran Mentawai  Cabin\"></p>\n<h4>The surf trip on Tengirri is all-included with a FREE photo and video service.</h4>\n<p>So bring your USB stick for your copy with the images taken by the guide and crew. 20 cartons of Bintang beer are included on top of all snacks, meals, tea and coffee, water and soft drinks.</p>\n<p>The Tengirri Mentawai Surf Charter its trip dates are fixed and 11 full days or 12 nights spend onboard. </p>\n<p><img src=\"/images/tengirri-mentawai-surf-charter-power-catamaran-deck.jpg\" alt=\"Tengirri Surf Charter Power Catamaran Mentawai Deck\" title=\"Tengirri Surf Charter Power Catamaran Mentawai  Deck\"></p>\n<h3>INCLUDED:</h3>\n<p>– pick-up and drop-off at Padang airport <br>\n– 12 nights air-conditioned accommodation  <br>\n– all meals, snacks, water, soft drinks, coffee, tea<br>\n– 20 cartons of Bintang per charter trip<br>\n– use of all equipment for fishing and snorkelling<br>\n– FREE video &#x26; photo service ( bring a usb flash drive )<br>\n– dinghy use for surfing, fishing<br>\n– experienced Australian surf guide and skipper</p>\n<h3>NOT INCLUDED:</h3>\n<p>– extra beer and other alcohol ( please advice at reservation )  <br>\n– phone calls: US$5/minute ( incoming calls are free ) <br>\n– email is not available<br>\n– The Mentawai Tax of rp 1,150,000 per surfer will be added and collected with your final payment.</p>\n<p>Tengirri will departure @ 3-4pm on the first day of the trip ( plan your arrival no later than 12pm on departure day). Return is in the morning on the last day, as the boat sails during the night to go back to the harbour.</p>\n<p><img src=\"/images/tengirr-surf-charter-mentawai-surfing.jpg\" alt=\"Tengirri Surf Charter Power Catamaran Mentawai surfer\" title=\"Tengirri Surf Charter Power Catamaran Mentawai surfer\"></p>"},{"url":"/posts/international-flights-to-maldives/","relativePath":"posts/international-flights-to-maldives.md","relativeDir":"posts","base":"international-flights-to-maldives.md","name":"international-flights-to-maldives","frontmatter":{"title":"International Flights to Maldives","date":"2020-03-25T15:56:57.966Z","thumb_img_path":"/images/international-flights-to-maldives-and-surfboard-fees.jpg","content_img_path":"/images/international-flights-to-maldives-and-surfboard-fees.jpg","excerpt":"What are the most popular airlines for your flight to Maldives ? Check the list and make sure you double check the policy to take your surfboards, as they change regularly.","template":"post"},"html":"<p>An important part of organising your Maldives surf charter trip is booking your international flight. <br>\n<br>\nThe most popular airlines for flights to Maldives are Emirates Airlines, Qatar Airways and Turkish Airlines. These allow surfers to take their boards without additional fees or surcharges. Even if the ticket is more expensive, this might save you as others might charge up to 100 US$ or more per surfboard. <br>\n<br>\nCompare prices and make sure you check the policies as these change regularly. <strong>Here a list with airlines and conditions: <a href=\"https://www.surfline.com/surf-news/boardbag-fees-airline/18407\">Airlines Baggage Fees</a></strong></p>"},{"url":"/posts/how-to-find-uncrowded-waves/","relativePath":"posts/how-to-find-uncrowded-waves.md","relativeDir":"posts","base":"how-to-find-uncrowded-waves.md","name":"how-to-find-uncrowded-waves","frontmatter":{"title":"How to find uncrowded waves","date":"2020-02-27T15:21:49.742Z","thumb_img_path":"/images/surf-charter-wave-mentawai-islands.jpg","content_img_path":"/images/surf-charter-wave-mentawai-islands.jpg","excerpt":"As surfing is getting more and more popular, it's getting more difficult to surf uncrowded waves. It's still possible though and booking a surf charter trip can be the way to get you into an empty lineup.","template":"post"},"html":"<p>The price we pay for ever cheaper long-haul travel is endemic crowding in the lineup. It’s getting harder and harder to score waves all to yourself.</p>\n<p>Every surfer is in search of uncrowded waves. If you are really determined there are always places where you can still find empty surf breaks. A boat trip gives you the flexibility of simply motor to the next wave if one break is too crowded. Although it’s getting harder and harder to score waves all to yourself, it’ still possible.</p>\n<h2>Book a surf charter outside peak season</h2>\n<p>One tip is to book a surf charter trip in the early or late season, where the surf is in general still epic and there are fewer boats cruising around. Another advantage is that rates are lower out of peak season.</p>\n<h2>Go surfing in remote surf areas</h2>\n<p>Another tip to score empty waves is to head off the beaten track. As crowds recede, costs go up though, because most boats charge extra fuel costs, which can add up swiftly. It’s not easy to work out exact prices without doing a detailed breakdown and analysis.</p>\n<p>The heavier waves in Indo can lead to more cutthroat crowds, whereas the Southern and Central Atolls in the Maldives still tend to be quieter.</p>"},{"url":"/posts/maldives-surf-charter-guide/","relativePath":"posts/maldives-surf-charter-guide.md","relativeDir":"posts","base":"maldives-surf-charter-guide.md","name":"maldives-surf-charter-guide","frontmatter":{"title":"Maldives Surf Charter Guide","date":"2020-02-27T15:58:08.195Z","thumb_img_path":"/images/empty-wave-maldives.jpg","content_img_path":"/images/empty-wave-maldives.jpg","excerpt":"The Maldives has become a real surfers paradise and very popular with beginner and experienced surfers. There is a wide variety of options, which can be overwhelming. We can divide The Maldives into 4 main areas: Northern Atolls, Male Atolls, Central Atolls and Southern Atolls. Each region is different in many ways.","template":"post"},"html":"<p>LTL Surf Charters has created this Maldives Surf Charter Guide for you. We explain you the setup of the Atolls. What is the best time to surf where? And what are the differences between the Atoll areas.</p>\n<p>The main surf season is March to October for Maldives, although there is swell all year round. Most surf charters won’t run trips between October and March though, as boats are in maintenance or they focus on diving, fishing and cruising outside of the peak surf season.</p>\n<p>The Maldives has become a real surfers paradise and very popular with beginner and experienced surfers. There is a wide variety of options, which can be overwhelming. We can divide The Maldives into 4 main areas: Northern Atolls, Male Atolls, Central Atolls and Southern Atolls. Each region is different in many ways.</p>\n<h2><strong>NORTHERN ATOLLS:</strong></h2>\n<p>The best known Atolls here are Baa Atolls and Raa Atolls.</p>\n<p>Northern Atolls is in general more quiet, as it is the only UNESCO reserve with the most beautiful nature. There are not a lot of boats cruising this area and only a few locals know the area well enough to guide surfers there.</p>\n<p>Northern Atolls is less consistent but also very uncrowded. It’s popular with SUP riders and longboarders. Trips are in general more expensive as a domestic flight might be included and there is extra fuel cost for the boat to get there.</p>\n<h2><strong>NORTH &#x26; SOUTH MALE ATOLLS:</strong></h2>\n<p>North and South Male Atolls are just north and south of the country’s capital with international airport, Male, and therefore most accessible. The Male Atolls is the busiest area as it offers the best waves that are easiest accessible. Season ranges from March to October with peak season May to August.</p>\n<p>North Male offers the most quality waves but also the biggest crowds. It has regular swells and is best protected from the wind.</p>\n<p>South Male is very similar but has fewer crowds and surf spots. This area is more protected from the swell and best when a bigger swell hits. Then you can score perfect empty surf.</p>\n<p>To surf North &#x26; South Male Atolls, there is no domestic flight required. So most boats stay in this area and rates for a surf charter trip are the cheapest.</p>\n<h2><strong>CENTRAL ATOLLS:</strong></h2>\n<p>Central Atolls consists of Faafu Atolls, Dhaalu Atolls, Meemu Atolls, Thaa Atolls and Laamu Atolls.</p>\n<p>In Central Atolls you find a wide variety of surf breaks and fewer crowds than around Male. Surf season is all year round, with the most consistent surf from March to October.</p>\n<p>Surf charter trips to Central Atolls are in general more expensive because of the fuel surcharges. Sometimes there is a one-way or return domestic flight involved, for less cruising time and more time for surfing. Cruising from Male to Central Atolls takes about 20 hours each way. This means that Central Atolls surf charter trips are in general more expensive.</p>\n<h2><strong>SOUTHERN ATOLLS:</strong></h2>\n<p>The best-known atolls in this area are Huvadhoo Atolls, Addu Atolls and Gaafu Dhaalu Atolls.</p>\n<p>The Southern Atolls face the open ocean and are real swell magnets. This area is most popular in March and April, but the rest of the year you can still find empty lineups. And there is surf year round, with the peak from March to October too. The wind might blow out the waves, so you’ll be safest to have good waves from late February to May and September to November.</p>\n<p>To reach the Southern Atolls you will have to take a domestic flight. Because of relocation costs for the boat too, these trips are more expensive.</p>\n<h2><strong>CONCLUSION:</strong></h2>\n<p>The best area for you to surf in The Maldives, depends on your level of surfing, budget and dates. But whatever choice you make, every surf charter vessel goes the extra mile to make sure the surfers on board are happy and get the best waves for the day and their level.</p>"},{"url":"/projects/the-dream-banyak/","relativePath":"projects/the-dream-banyak.md","relativeDir":"projects","base":"the-dream-banyak.md","name":"the-dream-banyak","frontmatter":{"title":"The Dream Banyak","subtitle":"Banyak/Telos - Fixed Schedule: 10d/11n, Individual/Group","date":"2020-03-23T12:14:54.853Z","thumb_img_path":"/images/the-dream-banyak-islands-surf-charter-boat-vessel.jpg","content_img_path":"/images/the-dream-banyak-islands-surf-charter-boat-vessel.jpg","template":"project"},"html":"<h3>The Dream Surf Charter navigates to the Banyak Islands in Sumatra, Indonesia, a real waves paradise.</h3>\n<p>As there are only a few surf charter boats sailing these waters, we will get you to surf without the crowds of Mentawais.</p>\n<p>Besides surfing, you will experience great fishing, amazing tropical nature and a fantastic adventure trip. Individual bookings are possible and we take groups up to 12 surfers max.</p>\n<p><img src=\"/images/the-dream-banyak-islands-surf-charter-boat-dining.jpg\" alt=\"The Dream Banyak Islands Surf Charter Boat outside dining\" title=\"The Dream Banyak Islands Surf Charter Boat outside dining\"></p>\n<p>The Dream Surf Charter is located at the Sibolga Harbour in West-Sumatra and will start the trip from there. Overnight you will sail to the Banyak Islands to surf a dozen remote waves. Some waves are still a secret, other known spots are Treasure, Cobra, Bay of Plenty, Lizards and Pulau Babi, which is a swell magnet when it’s flatter.</p>\n<p><img src=\"/images/the-dream-banyak-islands-surf-charter-boat-waves.jpg\" alt=\"The Dream Banyak Islands Surf Charter Boat waves\" title=\"The Dream Banyak Islands Surf Charter Boat waves\"></p>\n<p>The boat offers 5 separate large double rooms with large beds (1.4m)and a special cabin with a king size bed for couples. Another room is equipped for 4 guests, giving the boat a capacity of maximum 12 people in addition to the crew and guide. Pierre, the surf guide, has always been on the boat and knows the Banyak Islands as his pocket.</p>\n<p>The Dream Surf Charter is considered full with 10 people, but we can take up to 12. All cabins and the comfortable living room are fully air-conditioned. There are 2 bathrooms and a large 45 m2 terrace to check the waves and admire the amazing sunsets.</p>\n<p><img src=\"/images/the-dream-banyak-islands-surf-charter-boat-cabin.jpg\" alt=\"The Dream Banyak Islands Surf Charter Boat Cabins\" title=\"The Dream Banyak Islands Surf Charter Boat Cabins\"></p>\n<p>The Banyak Islands are a group of about 71 inhabited islands off the western coast of Sumatra. The largest island is Tuangku with Haloban as the principal town. On request, we can organise trips to the Telo Islands. Here you can find a variety of fun waves with a good range of power for intermediate to advanced surfers. Usually, there is a good opportunity for barrels in these clear waters with numerous lefts and rights reefs and long wrapping points.</p>\n<h4>INCLUDED:</h4>\n<ul>\n<li>unlimited surfing</li>\n<li>accommodation onboard</li>\n<li>3-daily meals, snacks, beers</li>\n<li>T-shirt or cap</li>\n</ul>\n<h4>NOT INCLUDED:</h4>\n<ul>\n<li>domestic return flight in Sibolga ( US$ 100) with surfboard transport @ $AUD 20 per board each way.</li>\n<li>spirits (bring your own or buy on board)</li>\n</ul>\n<h4>IMPORTANT:</h4>\n<ul>\n<li>For your domestic flight, you have to arrive the day before. If your trip leaves on the 10th for example, you must arrive on the 9th in Medan ( via Kuala Lumpur or Singapore), ideally in the evening. The boards will be picked up on your arrival and routed over land to Sibolga by car. </li>\n<li>On the way back, make sure you leave after 8 pm, as the surfboards will be brought back overland from the boat to Medan again. </li>\n<li>You will have to take an internal flight from Medan (KNO) to Sibolga (FLZ). </li>\n<li>Trip dates are usually from Monday to Friday, so you can travel on the weekend. The schedule is fixed but flexible with 1-2 days.</li>\n</ul>\n<h4>The Dream Surf Charter owners offer an optional package to make your arrival and departure easier and relax @ 300 US$:</h4>\n<p>They can pick you up at the international airport and bring you to the Marriott Hotel. The next morning you will be brought to the airport for your flight to Sibolga with your flight ticket in your pocket. All is included, except the dinner and drinks at the hotel. The same for your departure back home. This package includes the hotel, breakfast, taxi and return flights with boards.</p>\n<p><img src=\"/images/the-dream-banyak-islands-surf-charter-boat-sunset.jpg\" alt=\"The Dream Banyak Islands Surf Charter Boat Sunset\" title=\"The Dream Banyak Islands Surf Charter Boat Sunset\"></p>\n<h3>REVIEWS:</h3>\n<h4><strong><em>Steven, Trip 5 to 16 August 2019:</em></strong></h4>\n<p>An amazing trip for us all. A great crew and a very comfortable boat to live on. Pierre led us to great waves and we had a ball hanging out with him, he’s a real asset to your company. Suggestions for improvement would be a speed boat tender large enough for all.</p>\n<h4><strong><em>Arnaud, Trip 15 to 26 April 2019:</em></strong></h4>\n<p>Je ne sais par où commencer tellement je suis extremement heureux et satisfait de mon premier boat trip et ce grâce à toute l équipe du DREAM!!!!!!</p>\n<p>Si je devais résumer en un seul mot, ce serait la CLASSE!(ou la CLAQUE) car tout, je dis bien TOUT a été pensė ,réfléchi ou prévu pour que ce soit bien,bon ,facile ,comfortable , délicieux , copieux ,etc.</p>\n<p>Habitué et habitant en Indo, je ne pouvais m’attendre à un tel niveau de qualité et de compétences à travers le professionnalisme, le sérieux et la gentillesse des membres du crew tout ça mené d une main de maître par Pierre, un homme comme on en rencontre peu de nos jours, “personnage “unique et attachant, marin aguerri… une bien belle rencontre et un trip inoubliable…..!!!</p>\n<p>Je signe pour un abonnement multi-annuel…….</p>\n<h4><strong><em>Luke, Trip 15 to 26 April 2019:</em></strong></h4>\n<p>Amazing trip. Boat, crew, food and waves were amazing. Definitely will be coming back as I missed out on some amazing waves as my skill level and balls were not big enough!!</p>\n<p>Thanks for everything.</p>\n<h4><strong><em>Mehdi, Trip 18 to 29 March 2019:</em></strong></h4>\n<p>All amazing. Staff, boat, islands, water, etc… only good things to say. I’m not going to go through everything but here are a few highlights: Pierre’s knowledge of the islands, the wind, the break, the reef made a huge difference. We felt confident we were at the right spot at the right time. Definitely ahead of the one other boat. The crew was fantastic. Always available with a big smile. Never taking themselves too seriously which helped because we were probably not the most mature. Food was good, it must be hard to cook in these conditions and never was worried about the freshness.</p>\n<p>Opportunities (mostly because I’m barely an intermediate surfer): communication ahead of the trip with what is needed, how to prepare, the type of boards, the repair kit, etc… same for how to prepare physically to be able to surf 4/6h per day. Think set of 5 emails that gets you ready, and prepare you for the trip.</p>\n<p>Also, the opportunity to sell coaching packages with video, etc… Pierre did it naturally, but I would pay for having something more formal every day. Maybe hard to execute but just an idea.</p>"},{"url":"/posts/mentawai-surf-tourism/","relativePath":"posts/mentawai-surf-tourism.md","relativeDir":"posts","base":"mentawai-surf-tourism.md","name":"mentawai-surf-tourism","frontmatter":{"title":"Mentawai Surf Tourism","date":"2020-03-25T13:31:28.084Z","thumb_img_path":"/images/mentawai-surf-charter-wave-tourism.jpg","content_img_path":"/images/mentawai-surf-charter-wave-tourism.jpg","excerpt":"The Mentawai surf breaks offer remarkable consistency and quality the whole year round. During the southern hemisphere’s winter, the Indian Ocean is a real groundswell producing machine. A surf charter gives you the opportunity to score the best waves of your life.","template":"post"},"html":"<h3>Mentawais is a tropical archipelago of islands, just off the Sumatran mainland, offering postcard-perfect surf.</h3>\n<p>Here you will find open ocean swells that roll over shallow coral reef passes, creating some of the most beautiful waves on the planet. The Mentawais consist of a chain of about seventy islands and islets. They lie approximately 150 km off the Sumatran coast. Siberut (4,030 km²) is the largest island. The other major islands are Sipura, North Pagai (Pagai Utara) and South Pagai (Pagai Selatan).</p>\n<p>The Mentawai Islands are considered by many as the world’s premium surfing destination. They swell all year round with the <strong>‘peak season’ falling from April to October.</strong></p>\n<p>The gateway to Mentawai is through the city and <strong>airport of Padang</strong>. The best option to get there is <strong>a flight from Kuala Lumpur or Jakarta</strong>. The domestic airlines all accept surfboards. Do double check the conditions for sizes and number of boards. You can book with Air Asia, Mandala, Lion Air, Garuda Airlines, Batavia Air,…</p>\n<p>Once you arrive at Padang’s Airport, located 20 km north of town, the boat crew will be there and usually brings you to the harbour immediately. Sometimes you stay at a hotel for the first night. This depends on your arrival time and the boat itinerary. The boat departure times vary. Often they leave in the evening to travel at night. So you will be at the first surf spot by morning, for your first magic surf session.</p>\n<p>The Mentawais can be a little crowded during peak season, despite their remoteness. Tourism is based almost exclusively on surfing. A good charter boat with a good guide will go a long way towards that empty perfection. The possibilities are endless and they will do everything to make sure you get the best waves.</p>\n<p><strong>The Mentawai surf breaks offer remarkable consistency and quality the whole year round.</strong> During the southern hemisphere’s winter, the Indian Ocean is a real groundswell producing machine. <br>\n<br>\nA surf charter gives you the opportunity to score the best waves of your life. <strong>Being on a boat out on the ocean, there is lots of flexibility to move to the best spots</strong> at any given time. The crew and guide decide together with the surfers on board to which surf spot you will travel.</p>\n<p>The Mentawai Islands are inhabited by local fishermen who are in general very welcoming and friendly. You can get a feeling of the local nature spirits during an island visit, which most boats organise during the trip. Air temperatures are between 22°C ( 72° F) and 32°C ( 90°F). Water temperature is about 27°C ( 80°F)</p>"},{"url":"/posts/new-surfer-tax-mentawais/","relativePath":"posts/new-surfer-tax-mentawais.md","relativeDir":"posts","base":"new-surfer-tax-mentawais.md","name":"new-surfer-tax-mentawais","frontmatter":{"title":"New Surfer Tax Mentawais","date":"2020-03-25T15:46:25.671Z","thumb_img_path":"/images/surfer-tax-mentawai-islands.jpg","content_img_path":"/images/surfer-tax-mentawai-islands.jpg","excerpt":"From the 1st of July 2016, all surfers are charged a surfer tax at the airport arrival in Mentawai. The amount of Rp 1 million ( about US$ 75 or AU$ 105 ) is billed upon arrival, valid for 15 days, which can be extended.","template":"post"},"html":"<h3>From the 1st of July 2016, all surfers are charged a surfer tax at the airport arrival in Mentawai.</h3>\n<p>The amount of Rp 1 million ( about US$ 75 or AU$ 105 ) is billed upon arrival, valid for 15 days, which can be extended.  Some resorts or boats will pay the tax in advance for surfers, not to waste too much time at the airport during transfers. </p>\n<p><strong>There may be random inspections at any time.</strong> Other taxes for boat charters and film crews are implemented. <strong>These new taxes should help the country construct supporting facilities.</strong> It is expected to provide significant benefits in the regulation of the surfing tourism industry, improving the overall experience of visiting surfers. <br>\n<br>\nRoads, security, jetties and health facilities at a number of surf spots should be financed. <strong>This way the local people will benefit.</strong> Before, the money never made its way to the people but went into the pockets of the Tourism Ministry. Corruption has long been a problem. Let’s hope the new president, Joko Widodo, will put a stop on this.</p>\n<p>Mentawai still offers some of the best waves in the world. They don’t expect this tax to change the number of surfers coming to surf Mentawais. <strong>An average surf trip can cost up to $ 5000, so the tax is believed to make little impact.</strong></p>"},{"url":"/posts/surf-charter-checklist/","relativePath":"posts/surf-charter-checklist.md","relativeDir":"posts","base":"surf-charter-checklist.md","name":"surf-charter-checklist","frontmatter":{"title":"Surf Charter Checklist","date":"2020-03-25T13:04:24.255Z","thumb_img_path":"/images/surf-charter-checklist-what-to-bring-on-a-surf-boat-trip.jpg","content_img_path":"/images/surf-charter-checklist-what-to-bring-on-a-surf-boat-trip.jpg","excerpt":"What are the essentials you have to bring on a surf boat trip. Important things to arrange up front and to take on board with you besides the usual travel stuff...","template":"post"},"html":"<h3>What do I have to take on a surf charter trip?</h3>\n<p>First of all, remember that it’s always best to travel light! You don’t need much more than your surfboard, but there are a few essentials not to forget. </p>\n<p><strong>Most important is a good travel insurance</strong> as it’s mandatory on all boats for your own safety.</p>\n<p>Of course, you need to make sure you have <strong>your passport and a visa if necessary</strong> ( depending on your country of residence ) and don’t forget your airline ticket and best <strong>take a passport copy</strong> too. Make sure your deposit and balance payment for your trip are done and that all your travel arrangements are confirmed before you leave.</p>\n<h4>What do you have to bring for in the water?</h4>\n<p>Best <strong>2 to 4 surfboards, reef booties, extra leashes, fins, warm water wax</strong> and maybe <strong>a helmet or at least a surf hat</strong> for the sun. A spring wetsuit and/or boardshorts. A <strong>ding repair kit</strong> is a good idea to bring too. Don’t forget your <strong>sunblock</strong> of course.</p>\n<p>Take lightweight clothing in your luggage, shoes and sandals and the usual travel stuff like a beach towel, toiletries, your sunglasses, camera and <strong>basic medical kit with seasick pills</strong> and of course your prescription medicine. Surf charter guests often take <strong>headphones</strong> to relax and enjoy some of their favourite music.</p>\n<p>It’s a good idea to see your doctor before you leave and have a health check-up. Anti-malaria medication is normally not necessary while staying on a boat although sometimes advised. <strong>Insect repellent</strong> is always best to take.</p>"},{"url":"/posts/surf-charter-preparation/","relativePath":"posts/surf-charter-preparation.md","relativeDir":"posts","base":"surf-charter-preparation.md","name":"surf-charter-preparation","frontmatter":{"title":"Surf Charter Preparation","subtitle":"","date":"2020-03-25T15:23:49.313Z","thumb_img_path":"/images/best-surf-charter-preparation-for-a-hassl-free-trip.jpg","content_img_path":"/images/best-surf-charter-preparation-for-a-hassl-free-trip.jpg","excerpt":"What's important when you are planning to do a surf charter trip with your friends.? Make sure you choose a well-maintained boat and check facilities, extra's you want and more. Good preparation will bring you the best possible experience and long lasting memories....","template":"post"},"html":"<h3>Make sure that everyone is on the same page regarding standards, when you book with friends.</h3>\n<p>While not everyone in your group wants fine dining on board the vessel, make sure you go for a well-maintained boat with a professional, experienced crew and good chef. If you have friends that have <strong>particular dietary requirements or allergies, let them know in advance. Ask to stock up with your favourite bar drinks.</strong></p>\n<p><strong>Check what equipment is on board</strong> for fishing, snorkeling, diving, …. You might want to rent extra equipment or bring your own. If the boat does not have your favourite board game(s), you might want to take those too. <strong>Don’t forget your favourite book, dvd and music.</strong> While you will be in the water surfing most of the time, it’s good to prepare for the relaxing times in between or the days that the surf should be less consistent.</p>\n<p><strong>It’s worth considering add-ons like a photo or video service</strong> to document your trip, especially when you are travelling as a group. These details can make all the difference. Good preparations are most important and will provide you with the best memories until long after your trip.</p>"},{"url":"/posts/tony-hinde/","relativePath":"posts/tony-hinde.md","relativeDir":"posts","base":"tony-hinde.md","name":"tony-hinde","frontmatter":{"title":"Tony Hinde","date":"2020-03-25T16:15:07.092Z","thumb_img_path":"/images/tony-hinde-the-father-of-surfing-in-maldives.jpg","content_img_path":"/images/tony-hinde-the-father-of-surfing-in-maldives.jpg","excerpt":"Tony Hinde, named the father of surfing in Maldives, pioneered most of the best breaks in the Maldives and went on to set up the first private surf resort in the area at his beloved Pasta Point. ","template":"post"},"html":"<h4>Tony Hinde, named the father of surfing in Maldives, pioneered most of the best breaks in the Maldives.</h4>\n<p>He went on to set up the first private surf resort in the area at his beloved Pasta Point. Hudhuranfushi and Kandooma resorts later followed in Hinde’s footsteps, and claimed exclusive rights to the waves on their own ‘home reefs.’ This left only four of North Male Attol’s seven world class breaks open to all surfers – tourists and locals alike.</p>\n<p><strong>The Maldives surf has been one of the longest kept secrets, because Australian Tony Hinde managed to keep it quiet</strong> among his close friends between 1974 and 1988. He shipwrecked in the North Male Atolls and then discovered how good the surf is around Maldives. He became muslim and married to become a Maldivian citizen. He passed away in 2008, while surfing Pasta Point, his home spot.</p>\n<p>These days, the 4 passes gathering the bulk of the swell are often crowded with all types and abilities of recreational surfers, from the resorts, guest-houses or charter boats, but the vibe is always laid-back and friendly.</p>"},{"url":"/projects/santana-laut/","relativePath":"projects/santana-laut.md","relativeDir":"projects","base":"santana-laut.md","name":"santana-laut","frontmatter":{"title":"Santana Laut","subtitle":"Mentawai, Telos, Banyak - Fixed Schedule - Individual /Group","date":"2020-03-10T10:28:40.754Z","thumb_img_path":"/images/santana-laut-surf-charter-boat-mentawai-telos-banyaks.jpg","content_img_path":"/images/santana-laut-surf-charter-boat-mentawai-telos-banyaks.jpg","template":"project"},"html":"<h3>Experience a once in a lifetime surf charter trip on the amazing Santana Laut vessel.</h3>\n<p>The Santana Laut is a steel boat that has been converted to a surf charter in 2015. Originally it was a single screw fishing trawler. It offers a cabin saloon in the front of the boat and large decks at the back. There are 8 cabins ( 4x double bed, 2x double bed+single, 2x 4 single beds ) and 5 bathrooms. All accommodation areas are fully airconditioned.</p>\n<p><img src=\"/images/santan-laut-surf-charter-mentawai-cabins.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Cabins\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Cabins\"></p>\n<p>The Santana Laut will bring you an adventure filled with surfing, fishing, and exploration. The expert surf guides and experienced crew will guide you to the best surf of the day away from the madding crowds.</p>\n<p>You can travel to the Banyak Islands with great waves such as the Bay of plenty and Treasure island/Machine gun rights/ Whistle bird. Some of the most fun waves on the planet.</p>\n<p><img src=\"/images/santana-laut-surf-charter-boat-mentawai-telos-banyak-surfing.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak  Surfing\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak  Surfing\"></p>\n<p>Another possible destination is Telos, situated between Nias and The Mentawais. This area is extremely beautiful, think tropical paradise. It’s untouched and very remote. There are over 20 different waves. Many options for all levels and ultra-consistent in the 3 to 5-foot range.</p>\n<p>The Mentawai Islands have unique fauna and flora and a primate population. The area produces quality lineups with a variety of point breaks, reefs, and secluded bays. Sizes range from 2 to 12 foot with big swells up to 15 feet plus. Here you can surf fun sized walls to awesome stand-up barrels.</p>\n<p><img src=\"/images/santana-laut-surf-charter-mentawai-entertainment-area.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Entertainment\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak  Entertainment\"></p>\n<p>The Santana Laut offers a range of activities for individuals and groups, adults and children. Besides surfing, you can go snorkelling or fishing. Or enjoy swimming, beach days, village tours and SUP. In the evening you can play cards or board games and watch movies.</p>\n<p>Meals on Santana Laut are both tasty and healthy. Fruits, tea, coffee, fresh juice and bottled water are available at all times. The menu changes daily and may include traditional Indonesian dishes, burgers, pasta, Mexican food, fresh salads, fish sandwiches and more. When we catch fresh fish, we can prepare sashimi.</p>\n<p><img src=\"/images/santana-laut-surf-charter-boat-mentawai-telos-banyak-meals.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Meals\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak  Meals\"></p>\n<p>We can organize video and photography services on request. Please book at least 3 weeks in advance. Safety is very important, so we are here to educate and help you with a safety talk as detailed as you want.</p>\n<p>Contact us for the latest available schedule and a custom quote. Single surfer bookings are possible and we take up to 12 pax maximum.</p>\n<p><img src=\"/images/santana-laut-surf-charter-boat-mentawai-telos-banyak-deck.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak deck\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak deck\"></p>\n<h3>INCLUDED :</h3>\n<p>– Pick-up &#x26; drop-off from the airport <br>\n– 12 nights accommodation on the boat <br>\n– 3 gourmet meals from the excellent chef <br>\n– Snacks, drinks <br>\n– 30 x cases of beers <br>\n– Use of SUP’s and kayak, fishing and snorkelling gear <br>\n– Tender boat for up to 10 people, equipped with fish finder gps and board racks.</p>\n<h3>NOT INCLUDED:</h3>\n<p>– Accommodation in Padang <br>\n– Airfares <br>\n– Mentawai Tax <br>\n– Yoga ( on request @ extra cost )\\\n– Healthy organic food ( on request @ extra cost )<br>\n– Apnea and surf survival course ( on request @ extra cost)</p>\n<p><img src=\"/images/santana-laut-surf-charter-mentawai-nature-views.jpg\" alt=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Nature views\" title=\"Santana Laut Surf Charter Boat Mentawai Telos Banyak Nature Views\"></p>"}],"site":{"siteMetadata":{"siteUrl":"https://www.ltlsurfcharters.com/"},"pathPrefix":"","data":{"author":{"name":"","email":"","avatar":""},"menus":{},"social":{"links":[{"type":"instagram","title":"Instagram","icon":"fa-instagram","url":"https://www.instagram.com/ltlsurfcharters/"},{"title":"Facebook","icon":"fa-facebook","url":"https://www.facebook.com/LTLSurfCharters/"},{"title":"YouTube","url":"https://www.youtube.com/channel/UCsqvT1NEOopHMN6gcZer0yw","icon":"fa-youtube"},{"type":"twitter","title":"Twitter","icon":"fa-twitter","url":"https://twitter.com/ltlsurfcharters"},{"title":"Pinterest","icon":"fa-pinterest","url":"www.pinterest.com/LTLSurfCharters"}]}}},"menus":{"main":[{"page___NODE":"68c62901-d624-5459-80fb-c9720efca6e4","id":"menu-main-index","identifier":"main-index","title":"Home","weight":1,"url":"/","items":[]},{"page___NODE":"a481e950-3b92-5851-8891-c24efb0d6943","id":"menu-main-portfolio-index","identifier":"main-portfolio-index","title":"Collection","weight":2,"url":"/portfolio/","items":[]},{"page___NODE":"5c06edf2-8f78-5540-94d5-e5b5f8b0c61e","id":"menu-main-blog-index","identifier":"main-blog-index","title":"Editorial","weight":3,"url":"/blog/","items":[]},{"page___NODE":"7d1c2a43-d6a0-5b84-828b-bf39b3146ce1","id":"menu-main-about","identifier":"main-about","title":"About","weight":4,"url":"/about/","items":[]},{"page___NODE":"cdf37d29-ce1d-5d14-9692-d4099ba16a00","id":"menu-main-contact","identifier":"main-contact","title":"Contact","weight":5,"url":"/contact/","items":[]},{"page___NODE":"82839e86-bf68-5fdb-80a9-a67e7e8cdb7b","id":"menu-main-privacy-policy","identifier":"main-privacy-policy","title":"Privacy Policy","weight":5,"url":"/privacy-policy/","items":[]}]}}}